{
  "nodes": [
    {
      "id": "COURSE_COM4304",
      "labels": ["Course"],
      "course_code": "COM4304",
      "course_title": "Communication and Development",
      "description": "This course examines the role media play in the promotion of social change in areas such as the environment, health, population, education, and traffic safety. This course explores the expansion of new media technologies and their implications on development issues. The course addresses ways in which groups have used new media technologies to further their social or political agendas or short-circuit local market constraints. Students will learn the conceptual and methodological skills required for the design and implementation of communication programs for social change.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70f2"]
    },
    {
      "id": "COURSE_COM4401",
      "labels": ["Course"],
      "course_code": "COM4401",
      "course_title": "Digital Advertising Production",
      "description": "Through lectures, demonstrations, and classroom exercises, students explore the capabilities and uses of a range of digital design tools. Focusing on production of Web- specific advertising materials, students gain applied and theoretical knowledge of interactive advertising development. Through an exploration of the history and future of the infrastructure of the Web as a medium for interactivity, students learn how to create effective advertising solutions and communication specific to the various online media.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70f3"]
    },
    {
      "id": "COURSE_COM4405",
      "labels": ["Course"],
      "course_code": "COM4405",
      "course_title": "Media Production Project Seminar",
      "description": "This course further develops students’ understanding of production processes involved in the execution of creative content. Using digital videos and production/editing software, the students will undertake practical creative tasks. The course examines several different aspects of creative production, from creating powerful visual images, using digital cameras and videos, creating, recording, and manipulating sound for creative purposes, filming and editing video, copywriting, scriptwriting, and narrative development. The course is designed to help develop students’ skills in producing and understanding creative and persuasive content.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70f4"]
    },
    {
      "id": "COURSE_ECO2310",
      "labels": ["Course"],
      "course_code": "ECO2310",
      "course_title": "Introduction to International Economics",
      "description": "ration students. Students minoring in International Studies who have taken ECO 3301 International Trade and FIN 4304 International Finance are exempted from taking this course.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["International Studies"],
      "source_ids": ["68feaa3cb09198893aba70f5"]
    },
    {
      "id": "COURSE_FIN3301",
      "labels": ["Course"],
      "course_code": "FIN3301",
      "course_title": "Principles of Finance",
      "description": "Financial management for business and the corporation emphasizes the conceptual framework and principles of financial management for business organizations. The topics of the course are designed to integrate the knowledge from the introductory courses in accounting and economics, with a special focus on financial decision- making.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3cb09198893aba70f6"]
    },
    {
      "id": "COURSE_GBU3311",
      "labels": ["Course"],
      "course_code": "GBU3311",
      "course_title": "Quantitative Methods in Business",
      "description": "This course is designed to provide foundations of statistical methods for managerial decision-making. The course offers an extensive coverage of inferential statistics: one- or two-population hypothesis testing, ANOVA, chi-square tests, regression analysis, and time series forecasting.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor", "Free_Electives"],
      "disciplines": ["Business Administration", "Free Electives"],
      "source_ids": ["68feaa3cb09198893aba70f7", "68feaa37b09198893aba709d"]
    },
    {
      "id": "COURSE_GBU4308",
      "labels": ["Course"],
      "course_code": "GBU4308",
      "course_title": "Foundations of E-Commerce",
      "description": "This course introduces concepts and methods surrounding electronic commerce practices. The student gains a command of the current e-commerce business models, opportunities, and related barriers. The focus is on innovative thinking with respect to turning e-commerce technologies into value for companies.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3cb09198893aba70f8"]
    },
    {
      "id": "COURSE_GEO1301",
      "labels": ["Course"],
      "course_code": "GEO1301",
      "course_title": "Introduction to Geography",
      "description": "This introductory social science course provides a survey ofthe principles of human geography. Students are initiated in the basic concepts required for the spatial analysis of social phenomena, including notions of scale and cartographic representation. Global systems and patterns are approached with a view to understanding current social issues such as development, migration, and the environment. The relevance of spatial models to the analysis of contemporary issues is discussed. The course involves in-",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor", "GenEd"],
      "disciplines": ["International Studies", "Social Sciences"],
      "source_ids": ["68feaa3cb09198893aba70f9", "68feaa3ab09198893aba70c4"]
    },
    {
      "id": "COURSE_HIS3301",
      "labels": ["Course"],
      "course_code": "HIS3301",
      "course_title": "International History: 1914 to the Present",
      "description": "This course aims to survey world history from a specifically international perspective from the origins of World War | to the present by looking at war, diplomacy, and cooperation between states. The origins, courses, and outcomes of the two World Wars are studied, as are other conflicts that have helped shape the international scene. The rise of the superpowers and the Cold War is examined together with the various efforts at international co-operation, such as the League of Nations, the United Nations,",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["International Studies"],
      "source_ids": ["68feaa3cb09198893aba70fa"]
    },
    {
      "id": "COURSE_INS2301",
      "labels": ["Course"],
      "course_code": "INS2301",
      "course_title": "Theories of International Relations",
      "description": "The course is a survey of the main theories and models of international relations. After considering some concepts such as order, power, sovereignty, and international justice, the course examines central themes in international relations, such as the balance of power, international law and organizations, diplomacy, and globalization. The course focuses on four influential theories of international relations: Realism, Liberalism, Marxism, and Constructivism.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["International Studies"],
      "source_ids": ["68feaa3cb09198893aba70fb"]
    },
    {
      "id": "COURSE_INS3303",
      "labels": ["Course"],
      "course_code": "INS3303",
      "course_title": "International Law",
      "description": "International law plays an important role in international relations. This course identifies the basic elements and institutions such as the sources of law (including the Statute of the International Court of Justice and the Vienna Convention on the Law of Treaties); sovereignty, jurisdiction, the role of the International Court of Justice and other international tribunals, the relationship between international law and domestic (municipal) law, and selected substantive issues in International Law (such as human rights, criminal law, and environmental law).",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["International Studies"],
      "source_ids": ["68feaa3cb09198893aba70fc"]
    },
    {
      "id": "COURSE_MGT3301",
      "labels": ["Course"],
      "course_code": "MGT3301",
      "course_title": "Principles of Management",
      "description": "This course offers an overview of the art and science of Management. The broad categories covered are the evolution of management theory, decision-making procedures, foundations of leading and managing, and strategic management. The course provides an overview of the management of organizations and gives students insight into modern management practices.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3cb09198893aba70fd"]
    },
    {
      "id": "COURSE_MGT3302",
      "labels": ["Course"],
      "course_code": "MGT3302",
      "course_title": "Entrepreneurship",
      "description": "This course introduces students to the role of the entrepreneur in the economic system and how to start,",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3cb09198893aba70fe"]
    },
    {
      "id": "COURSE_MGT4303",
      "labels": ["Course"],
      "course_code": "MGT4303",
      "course_title": "Operations Management",
      "description": "This course introduces the field of operations management and a state-of-the-art view of the primary activities of the operations function in manufacturing and service organizations. It provides basic principles of designing, analyzing, and controlling production systems and the allocation and use of resources to produce goods and services.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3cb09198893aba70ff"]
    },
    {
      "id": "COURSE_MIS3302",
      "labels": ["Course"],
      "course_code": "MIS3302",
      "course_title": "Managing Information Systems and Technology in the Global Marketplace",
      "description": "This course covers the managerial and organizational issues involved in operating a firm. The role of automated information processing, automated support processes, and control of information systems is reviewed. Planning the development, direction, and control of computer information systems are examined.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3cb09198893aba7100"]
    },
    {
      "id": "COURSE_MKT3301",
      "labels": ["Course"],
      "course_code": "MKT3301",
      "course_title": "Principles of Marketing",
      "description": "This course gives an outline of common marketing concepts and models with the purpose of developing responsive marketing strategies that meet customers’ needs. The course also focuses on the use of marketing in organizations and society. Topics include marketing environment, consumer behavior, marketing research, segmentation, and international/global marketing with relevance to cultural diversity and ethics.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3db09198893aba7101"]
    },
    {
      "id": "COURSE_MKT4304",
      "labels": ["Course"],
      "course_code": "MKT4304",
      "course_title": "Marketing Research",
      "description": "This course focuses on the use of marketing research as an aid to making marketing decisions. Specifically, the course addresses how the information used to make marketing decisions is gathered and analyzed. Topics include the marketing research process, research design, research methodologies, data collection, analysis, and interpretation.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3db09198893aba7102"]
    },
    {
      "id": "COURSE_MKT4305",
      "labels": ["Course"],
      "course_code": "MKT4305",
      "course_title": "Marketing Management",
      "description": "This course is concerned with the development, evaluation, and implementation of marketing management in complex environments. It focuses on formulating and implementing marketing management strategies and policies, a task undertaken in most companies at the strategic business unit level. In order to further disseminate knowledge and skills in essential aspects of marketing strategy and emerging New Economy marketing applications, the course covers the development and execution of programs, audits, and plans.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3db09198893aba7103"]
    },
    {
      "id": "COURSE_PSC2301",
      "labels": ["Course"],
      "course_code": "PSC2301",
      "course_title": "Comparative Political Systems",
      "description": "The course aims to provide a solid introduction to the major concepts, theories, and debates relevant to. contemporary politics. It includes an analysis of the origins and development of the state, with particular emphasis on the democratic state. It provides an overview of the main systems of government, of different models of organization of local administrations and bureaucracies, and of the roles of political",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor", "GenEd"],
      "disciplines": ["International Studies", "History or Political Science"],
      "source_ids": ["68feaa3db09198893aba7104", "68feaa3ab09198893aba70d1"]
    },
    {
      "id": "COURSE_PSY1303",
      "labels": ["Course"],
      "course_code": "PSY1303",
      "course_title": "Clinical Psychology and Psychopathology",
      "description": "This course will provide an overview of clinical psychology and psychopathology. Clinical psychology is the study of the assessment, prevention, amelioration of psychological distress, and the enhancement of psychological and physical well-being. Psychopathology is the study of “abnormal” behavior or mental disorders. We will consider how “abnormality” is defined, and we will learn about the phenomenology and the causes of mental disorders. This class will challenge ideas about the definition of mental illness, with special attention given to the Moroccan context, and it will help develop conceptual knowledge intended to enhance critical thinking in this area. Note: This course will not aid in understanding personal experiences with mental illness.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba7105"]
    },
    {
      "id": "COURSE_PSY2302",
      "labels": ["Course"],
      "course_code": "PSY2302",
      "course_title": "Cognitive Sciences & Cognitive Psychology",
      "description": "This course offers a broad introduction to scientific theory and research in the study of human mental",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba7106"]
    },
    {
      "id": "COURSE_PSY2303",
      "labels": ["Course"],
      "course_code": "PSY2303",
      "course_title": "Developmental Psychology",
      "description": "This course offers an overview of human development across the life span, from prenatal to late",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba7107"]
    },
    {
      "id": "COURSE_PSY2304",
      "labels": ["Course"],
      "course_code": "PSY2304",
      "course_title": "Psychology of Health",
      "description": "This course offers an overview of the basics of health psychology, knowing what stress is according to the biopsychosocial model describing various methods for studying stress and health, and identifying other factors, such as underlying health habits and lifestyles. Additionally, students will look at positive health outcomes and gender and cultural differences in stress and health, such as common stressors and expressions of stress in Moroccan society. Finally, various health issues (e.g., sleep behaviors, pain, and exercise) will be discussed.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba7108"]
    },
    {
      "id": "COURSE_PSY3302",
      "labels": ["Course"],
      "course_code": "PSY3302",
      "course_title": "Social and Organizational Psychology",
      "description": "This course looks at the influences that people have on the attitudes, beliefs, and behavior of others.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba7109"]
    },
    {
      "id": "COURSE_PSY3304",
      "labels": ["Course"],
      "course_code": "PSY3304",
      "course_title": "- Industrial and Organizational Psychology (3SCH)t",
      "description": "Industrial and Organizational (I/O) Psychology is the scientific study of human behavior in organizations and the workplace. It focuses on understanding and improving the well-being and performance of individuals and teams through evidence-based practices. Industrial and organizational psychology focuses on the behavior of employees in the workplace. They apply psychological principles and research methods to improve the overall work environment, including performance, communication, employee satisfaction, safety, and multicultural concerns such as biases. I/O psychologists also play a key role in areas such as talent acquisition, leadership development, organizational change, and work-life balance. This field bridges psychology and business, equipping students with skills to make meaningful contributions to both employee experience and organizational success.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba710a"]
    },
    {
      "id": "COURSE_PSY3305",
      "labels": ["Course"],
      "course_code": "PSY3305",
      "course_title": "Interpersonal Relations and Conflict Resolution",
      "description": "This course will focus on the psychological causes, dynamics, and consequences of interpersonal and intergroup conflict. Topics discussed will include such issues as the role of power, status, trust, and social identity. Students will learn about various theories related to the causes of conflict, including negotiation, mediation, and facilitation.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba710b"]
    },
    {
      "id": "COURSE_PSY3306",
      "labels": ["Course"],
      "course_code": "PSY3306",
      "course_title": "Human Sexuality and Genders",
      "description": "This course offers a study of: the biological basis of the human sexual response system; sexual",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba710c"]
    },
    {
      "id": "COURSE_PSY3391",
      "labels": ["Course"],
      "course_code": "PSY3391",
      "course_title": "- Forensic Psychology",
      "description": "This introductory course provides students with a comprehensive overview of the field of forensic psychology, exploring its role at the intersection of psychology and the legal system. Through a multidisciplinary approach, students will examine the application of psychological principles, theories, and research methods to legal issues and criminal justice processes. Among the topics that may be covered include forensic assessment and evaluation, risk assessment, offender treatment and rehabilitation, and ethical considerations in forensic practice. By integrating theoretical knowledge with real-world case studies and practical applications, students will develop a deeper understanding of the complexities of human behavior within legal contexts and the contributions of forensic psychology to the administration of justice and the promotion of public safety.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba710d"]
    },
    {
      "id": "COURSE_PSY3392",
      "labels": ["Course"],
      "course_code": "PSY3392",
      "course_title": "- Psychology of Social Media",
      "description": "This course explores the psychological impact of social media on individuals and societies. It delves into how social media influence identity, self-presentation, and interpersonal relationships. Topics include the effects of social media on mental health, the psychology behind online behaviors, and the ethical considerations of digital communication. Students will critically analyze current research and trends to understand the complex relationship between social media use and psychological well-being.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba710e"]
    },
    {
      "id": "COURSE_PSY3393",
      "labels": ["Course"],
      "course_code": "PSY3393",
      "course_title": "- Political Psychology",
      "description": "This course serves as an introduction to the dynamic field of political psychology, offering students a comprehensive exploration of the intersection between psychology and politics. Through an interdisciplinary lens, students will examine how psychological theories, methods, and concepts inform our understanding of political behavior, attitudes, and decision-making processes. Topics may include political socialization, ideology, leadership, group dynamics, political identity, voting behavior, public Opinion, intergroup relations, conflict resolution, and the psychological impact of political events and institutions. By integrating theoretical frameworks with empirical research and case studies, students will develop critical insights into the psychological underpinnings of political phenomena and their implications for governance, policymaking, and society.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba710f"]
    },
    {
      "id": "COURSE_PSY3395",
      "labels": ["Course"],
      "course_code": "PSY3395",
      "course_title": "- Educational Psychology",
      "description": "This introductory course provides a comprehensive overview of the fundamental principles and theories in educational psychology. Students will delve into the core concepts surrounding human learning, development, motivation, and cognition within educational contexts. Through the exploration of topics such as cognitive development, learning theories, motivation, classroom management, assessment, individual differences, and the influence of culture on learning, students will gain foundational knowledge essential for understanding educational processes. Emphasizing a blend of theoretical study, practical application, and case analysis, this course equips students with the necessary insights to comprehend and apply psychological principles to educational practices effectively.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Psychology"],
      "source_ids": ["68feaa3db09198893aba7110"]
    },
    {
      "id": "COURSE_SCM4301",
      "labels": ["Course"],
      "course_code": "SCM4301",
      "course_title": "Introduction to Supply Chain Management",
      "description": "Supply chain management is the integration of all activities associated with the flow and transformation of goods. Logistics is part of the supply chain process that plans, implements, and controls the efficient flow and storage of goods. This course provides an introduction to logistics and supply chain concepts, structures, design, and control.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3db09198893aba7111"]
    },
    {
      "id": "COURSE_CHE1400",
      "labels": ["Course"],
      "course_code": "CHE1400",
      "course_title": "Chemistry and the Environment",
      "description": "This is an introduction to the basic principles of chemistry, with emphasis on applications in contemporary societies, particularly those applications involving the environment (energy, water, polymers, pollution, etc.) and health (food, food reduction, drugs, etc.). A two-hour laboratory supports the lecture material.",
      "sch_credits": 0,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa37b09198893aba7098"]
    },
    {
      "id": "COURSE_COM1304",
      "labels": ["Course"],
      "course_code": "COM1304",
      "course_title": "New Media Technology",
      "description": "The course explores the history of media technology from Guttenberg onward with a focus on recent developments in digital media and the internet. Developments in media and technology have impacted how we communicate and how we conduct business and politics. The course focuses on a number of critical issues related to emerging media such as surveillance, security, ownership, and control. This course will explore key legal and regulatory issues raised by new media, including free speech, copyright enforcement, net neutrality, and privacy, among others.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives", "Minor"],
      "disciplines": ["Free Electives", "Communication"],
      "source_ids": ["68feaa37b09198893aba7099", "68feaa3bb09198893aba70e3"]
    },
    {
      "id": "COURSE_CSC1300",
      "labels": ["Course"],
      "course_code": "CSC1300",
      "course_title": "Introduction to Computers",
      "description": "A thorough and non-technical guide to computing in modern society. Students acquire necessary concepts and skills to apply computing principles in their personal and professional lives. Topics include hardware, software, data storage, networking, privacy, ethics, security, and algorithmic problem solving. Lab sessions explore operating systems, productivity software such as spreadsheets, and an introduction to programming, currently using Python as a programming language.",
      "sch_credits": 0,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa37b09198893aba709a"]
    },
    {
      "id": "COURSE_ENG2304",
      "labels": ["Course"],
      "course_code": "ENG2304",
      "course_title": "Special Topics in Writing",
      "description": "This course provides the opportunity to explore new topics in writing, rhetoric, and professional communication. It will vary in content according to faculty expertise and relevancy of current issues in composition. Each time the course is offered, the specific content will be announced. Depending on the subject matter, students may be required to have completed required prerequesite courses.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa37b09198893aba709b"]
    },
    {
      "id": "COURSE_ENG2311",
      "labels": ["Course"],
      "course_code": "ENG2311",
      "course_title": "Translation",
      "description": "The aim of this Arabic-English Translation course is to help students improve their English composition skills at both the graduate and undergraduate levels, and to reinforce their command and knowledge of the English language and culture. It is also an introduction to the principles of professional translation, methodology, translation software, and cognitive processes involved in translation. Through the translation process, students will develop awareness of the problems in Arabic-English vocabulary, grammar, syntax, various types of sentence structure, phraseology, rhetoric, and style. Close attention will be paid to language interference, to formal/informal language, and to British vs. American English in terms of diction, spelling norms, and grammar. The course will also encourage students to recognize the purpose of different types (narrative, reporting, descriptive, expository, and argumentative) of texts being translated. It will provide some theory, but a lot of practice, with the aim of helping students to expand their international communication skills, regardless of their field of study.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa37b09198893aba709c"]
    },
    {
      "id": "COURSE_HIS2301",
      "labels": ["Course"],
      "course_code": "HIS2301",
      "course_title": "Contemporary World History",
      "description": "This course provides a broad overview of the major developments affecting different parts of the world in the modern era. Although much of the course deals with the political, social, and cultural history of Europe as a historical catalyst in the ways in which modernity has been shaped, special attention is paid to the interactions between Europe and other geographical areas such as Africa, Asia, and Latin America. The course takes an interdisciplinary perspective as a way of understanding these world regions.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives", "GenEd"],
      "disciplines": ["Free Electives", "History or Political Science"],
      "source_ids": ["68feaa37b09198893aba709e", "68feaa3ab09198893aba70c6"]
    },
    {
      "id": "COURSE_HRD2301",
      "labels": ["Course"],
      "course_code": "HRD2301",
      "course_title": "Business Environment and Ethics for HRD",
      "description": "An introduction to business issues for HRD specialists. An overview of the global business environment and ethics are foundational. In addition, students are introduced to broader business domains of entrepreneurship, management, marketing, information technology systems, and financial management.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa37b09198893aba709f"]
    },
    {
      "id": "COURSE_HRD3302",
      "labels": ["Course"],
      "course_code": "HRD3302",
      "course_title": "Ethics in Professional Contexts",
      "description": "What obligations do professionals have towards their corporations, clients, employees, and themselves? What should they do when obligations conflict? To what extent can religious values and traditions help us answer questions about work and the workplace? In examining these questions, we integrate a philosophical approach with case studies from business and the professions, learning to apply ethical theories to situations in the contemporary workplace. Attention will also be given to cross-cultural issues in business and ethics.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa38b09198893aba70a0"]
    },
    {
      "id": "COURSE_HUM2301",
      "labels": ["Course"],
      "course_code": "HUM2301",
      "course_title": "Islamic Art and Architecture",
      "description": "This course is an introduction to Islamic art and architecture with an emphasis on the Maghreb and Al-Andalus. The first section of the course deals with the period of formation of Islamic art from the advent of Islam to the end of the Umayyad period. The second section consists of a survey of the art and architecture of the major dynasties of the Islamic West from A.D. 750 to A.D. 1800. The last section of the course links Islamic art, architecture, and urbanism to their social and economic contexts. The course requires students to consider the intellectual and humanist dimensions of artistic production.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives", "GenEd"],
      "disciplines": ["Free Electives", "Art Appreciation & Creation"],
      "source_ids": ["68feaa38b09198893aba70a1", "68feaa3ab09198893aba70c8"]
    },
    {
      "id": "COURSE_LIT2301",
      "labels": ["Course"],
      "course_code": "LIT2301",
      "course_title": "Major Works of World Literature",
      "description": "This course is designed to give students a generous sampling of the major works of World Literature. Using a multi-disciplinary approach, the course focuses on reading, analyzing, and discussing works drawn from the various historical periods and genres. Works from various geo-cultural regions, aboriginal, and immigrant writers, as well as from male and female writers, are included.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives", "GenEd"],
      "disciplines": ["Free Electives", "Humanities"],
      "source_ids": ["68feaa38b09198893aba70a2", "68feaa3ab09198893aba70cd"]
    },
    {
      "id": "COURSE_LIT2304",
      "labels": ["Course"],
      "course_code": "LIT2304",
      "course_title": "Introduction to Arabic Literature",
      "description": "enable students to differentiate between them and to appreciate beauty in a literary work of art. Literary concepts are introduced and followed by reading, analysis, and discussion of works drawn from various genres.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa38b09198893aba70a3"]
    },
    {
      "id": "COURSE_MTH1305",
      "labels": ["Course"],
      "course_code": "MTH1305",
      "course_title": "Mathematics for Business",
      "description": "Introduction and review of fundamental mathematical concepts needed for business majors. Applications of algebra, functions, and graphs, exponential and logarithmic functions, matrix algebra, differentiation, curve sketching, integration methods and applications. Emphasis on problem solving.",
      "sch_credits": 0,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa38b09198893aba70a4"]
    },
    {
      "id": "COURSE_MTH1388",
      "labels": ["Course"],
      "course_code": "MTH1388",
      "course_title": "Introductory Mathematical Thinking 3SCH",
      "description": "This course is an introduction to topics in mathematics useful for humanities and social science students. Topics covered include problem solving, logic, algebraic equations and inequalities, graphing and functions, systems of linear equations, linear programming, financial mathematics, counting methods and probability, and voting methods. Emphasis is placed on showing how mathematics can be used to solve real-world problems. Students will be introduced to the use of quantitative thinking in the study of social phenomena.",
      "sch_credits": 0,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa38b09198893aba70a5"]
    },
    {
      "id": "COURSE_PHY1400",
      "labels": ["Course"],
      "course_code": "PHY1400",
      "course_title": "Conceptual Physics",
      "description": "The course deals with basic concepts and principles of classical and modern physics for non-science majors, which lead to a better understanding of the physical universe and the way physics has influenced civilization.",
      "sch_credits": 0,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa38b09198893aba70a6"]
    },
    {
      "id": "COURSE_SPN1301",
      "labels": ["Course"],
      "course_code": "SPN1301",
      "course_title": "Beginning Spanish I",
      "description": "This course is intended for students who have no basic knowledge in Spanish. They will apply, develop, and integrate different language skills, such as listening, speaking, reading comprehension, and writing. Upon completion of this course, students will be able to express themselves both in spoken and written Spanish. In addition, they will be able to understand brief speeches, advice and instructions, to introduce themselves, their work and place of residence, say things that please (or displease) them, and reply to. questions about their immediate needs and everyday topics. Students will have a certain command of related grammatical elements: how to use the present tense, the imperative, and the simple past.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Free_Electives"],
      "disciplines": ["Free Electives"],
      "source_ids": ["68feaa38b09198893aba70a7"]
    },
    {
      "id": "COURSE_ACC2301",
      "labels": ["Course"],
      "course_code": "ACC2301",
      "course_title": "Accounting Principles |",
      "description": "This course is an introduction to the fundamental concepts of financial accounting, double entry accounting theory, recording procedures, and financial statements preparation and analysis.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3bb09198893aba70e1"]
    },
    {
      "id": "COURSE_ACC2302",
      "labels": ["Course"],
      "course_code": "ACC2302",
      "course_title": "Accounting Principles II",
      "description": "This course covers basic cost relationships, cost behavior, cash flow statements, financial statement analysis, including ratio analysis, horizontal, and vertical analysis cost of products for managerial decision-making, forecasting, budgeting, and profitability analysis.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Business Administration"],
      "source_ids": ["68feaa3bb09198893aba70e2"]
    },
    {
      "id": "COURSE_COM2301",
      "labels": ["Course"],
      "course_code": "COM2301",
      "course_title": "Professional Communication",
      "description": "The course presents basic theories and strategies of communication as they relate to professional work contexts, such as interpersonal communication, professional presentations, organization of groups and meetings, and conducting interviews. Students will practice these skills through presentations and role-playing. They will also learn to compose basic written forms of communication essential for the professional",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3bb09198893aba70e4"]
    },
    {
      "id": "COURSE_COM2327",
      "labels": ["Course"],
      "course_code": "COM2327",
      "course_title": "Art and Design Production",
      "description": "This course introduces fundamental art concepts and histories important in all aspects of contemporary design from print and photography to website interface. Starting from the earliest expressions of culture through visual media, the course will conclude with practical implementations of digital design concepts. Students will be introduced to the vocabulary and working terms of artists and designers as well as visiting core theories and histories of design, from European to Arabian aesthetics, past and present.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Minor", "GenEd"],
      "disciplines": ["Communication", "Art Appreciation & Creation"],
      "source_ids": ["68feaa3bb09198893aba70e5", "68feaa39b09198893aba70b8"]
    },
    {
      "id": "COURSE_COM2403",
      "labels": ["Course"],
      "course_code": "COM2403",
      "course_title": "Photography and Visual Story Telling",
      "description": "This introductory digital photography course balances visual theory with practical learning. Students will learn the basic elements of photography, SLR cameras, visual theories, history, and critiques. No prior experience in photography is needed, students are encouraged to bring their own manual-control camera or share lab cameras. The class structure will consist of lectures, demonstrations, readings, discussions, group critiques, and in-class working time. Students are expected to work on their projects outside class time.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3bb09198893aba70e6"]
    },
    {
      "id": "COURSE_COM2404",
      "labels": ["Course"],
      "course_code": "COM2404",
      "course_title": "Introduction to Film Making",
      "description": "This hands-on course introduces basic techniques of video and film production. In addition to learning about video and film and its applications as a medium of communication, students will learn basic video camera operation and will develop skills in lighting, editing, and sound acquisition. Students will create their own final non-sync projects.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3bb09198893aba70e7"]
    },
    {
      "id": "COURSE_COM3301",
      "labels": ["Course"],
      "course_code": "COM3301",
      "course_title": "Public Relations Communication",
      "description": "The course will cover the principles, history, theory, and practice of public relations in businesses, organizations, and agencies. The course will use case-method and campaign-planning approaches to analyze public relations programs. The course will also examine the responsibility of the public relations practitioner to management and to relevant publics, ethics of public relations practice, and the future of the field and career opportunities.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3bb09198893aba70e8"]
    },
    {
      "id": "COURSE_COM3304",
      "labels": ["Course"],
      "course_code": "COM3304",
      "course_title": "Alternative Media",
      "description": "The area of alternative media studies is an emerging field of inquiry. This course is designed to bring attention to not only the prevalence and influence of mainstream/mass media, but also to other types of media that circulate in the public sphere. Among the plethora of available media content, this course jiscusses which ones can be defined as alternative media. It offers an exploration of key debates in academic and media establishments concerning the criteria used for conceptualizing alternative media. The course then undertakes an examination of various historical and contemporary manifestations, with a particular focus on Arab alternative media. It also includes an examination of the limits of alternative media in terms of effecting social transformation.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3bb09198893aba70e9"]
    },
    {
      "id": "COURSE_COM3311",
      "labels": ["Course"],
      "course_code": "COM3311",
      "course_title": "Marketing Communications",
      "description": "This course introduces students to the strategic process of marketing communication, from understanding the target audience to evaluating a marketing communication campaign or strategy. ‘Students are exposed to principles of marketing, strategic planning, message creation, communication mix tools, and marketing communication measurement. Students will learn to create and evaluate a creative brief for advertisements, sales promotions, and use direct and interactive communication tools. Special emphasis is put on the design of a strategic marketing communication plan. Students are required to participate in a variety of communication activities and to perform a number of research tasks and practical assignments.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3bb09198893aba70ea"]
    },
    {
      "id": "COURSE_COM3315",
      "labels": ["Course"],
      "course_code": "COM3315",
      "course_title": "Media and Gender",
      "description": "The course examines the complex relationship between gender, culture, and the media in various societies. It introduces students to theories of communication, gender, and representation. They critically study portrayals of femininity and masculinity in oral and written literature, advertising, television, popular music, films, and cartoons. In addition, students are exposed to women's participation in cultural and media production.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3bb09198893aba70eb"]
    },
    {
      "id": "COURSE_COM3321",
      "labels": ["Course"],
      "course_code": "COM3321",
      "course_title": "Moroccan Media and Society",
      "description": "This course examines the role and function of the mediawithin Moroccan society. Itanalyzes the economic, legal, and political environments of media, the content of media messages, and the relationship between media and the Moroccan public.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70ec"]
    },
    {
      "id": "COURSE_COM3328",
      "labels": ["Course"],
      "course_code": "COM3328",
      "course_title": "Media Analysis",
      "description": "This course focuses on the textual, social, and cultural analysis of mass, print, and new media. Theoretical frameworks and methods include content analysis, genres study, ideological criticism, and various psychological approaches. This course may be offered with a particular theme, e.g., gender and",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70ed"]
    },
    {
      "id": "COURSE_COM3330",
      "labels": ["Course"],
      "course_code": "COM3330",
      "course_title": "Organizational Communication",
      "description": "‘Students explore the range of communication required in successful organizations including the writing of feasibility studies, policy and position papers, project plan proposals, and annual reports. The course examines the role of communication in organizations as well as the major theories of organizational communication, identifying and defining primary concepts, and applying them to discussions of real- world situations. The role of technology, corporate culture, leadership, teamwork, ethics, and diversity in communication is examined. Effective communication in global organizations and critiques of organization communication systems and structures are also presented.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70ee"]
    },
    {
      "id": "COURSE_COM3398",
      "labels": ["Course"],
      "course_code": "COM3398",
      "course_title": "Special Topics in Media",
      "description": "This course will be offered occasionally; topics will vary. Course may be taken for degree credit only once.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70ef"]
    },
    {
      "id": "COURSE_COM3399",
      "labels": ["Course"],
      "course_code": "COM3399",
      "course_title": "Special Topics in Communication",
      "description": "This course will be offered occasionally; topics will vary. Course may be taken for degree credit only once.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70f0"]
    },
    {
      "id": "COURSE_COM3402",
      "labels": ["Course"],
      "course_code": "COM3402",
      "course_title": "Advanced Film Production",
      "description": "This advanced, hands-on class builds on the skills learned in COM 2304 Introduction to Video and Film Production. It is an intensive hands-on course producing fiction projects and non-fiction documentary projects with additional skills in script-writing, advanced video techniques, and digital editing. Students are expected to work on their projects outside lecture times.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": true,
      "isSpecElective": false,
      "categories": ["Minor"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa3cb09198893aba70f1"]
    },
    {
      "id": "COURSE_ARA1201",
      "labels": ["Course"],
      "course_code": "ARA1201",
      "course_title": "Arabic Beginning",
      "description": "Designed for beginners, this course focuses on speaking and writingskills, and on teachingthe mechanics of writingin the Arabic script. Students practice and learn Arabic sounds, paying particular attention to the differences between Modern Standard Arabic and other Arabic varieties (Moroccan Arabic, in particular). By the end of the course, students are able to communicate in writing and in speech on personal topics and topics of everyday life. This course is designed exclusively for degree-seeking students who hold international high school degrees with no prior Arabic instruction, and they are enrolled in it based on placement test results.",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Arabic"],
      "source_ids": ["68feaa38b09198893aba70a8"]
    },
    {
      "id": "COURSE_ARA1202",
      "labels": ["Course"],
      "course_code": "ARA1202",
      "course_title": "Arabic Intermediate",
      "description": "At the intermediate level, students consolidate their writing and speaking abilities in terms of vocabulary, grammar, and style. The course enables students to express themselves with some degree of sophistication. This course develops the four language skills (listening, speaking, reading, and writing). The course also provides students with the necessary vocabulary to be able to communicate correctly in most situations. This course is designed exclusively for degree-seeking students who hold international high school degrees with no prior Arabic language instruction, and they are enrolled in it based on placement test results.",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Arabic"],
      "source_ids": ["68feaa38b09198893aba70a9"]
    },
    {
      "id": "COURSE_ARA1203",
      "labels": ["Course"],
      "course_code": "ARA1203",
      "course_title": "Arabic Advanced",
      "description": "At the advanced level, students further develop their Arabic language skills. It also introduces them to the study of Arabo-Islamic culture in order to be able to function effectively and appropriately in Arabic- speaking countries. The course is designed to provide students with the necessary linguistic tools to be able to interact with native speakers without difficulty. This course is designed exclusively for degree- seeking students who hold international high school degrees with no prior Arabic language instruction, and they are enrolled in it based on placement test results.",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Arabic"],
      "source_ids": ["68feaa38b09198893aba70aa"]
    },
    {
      "id": "COURSE_ARA3299",
      "labels": ["Course"],
      "course_code": "ARA3299",
      "course_title": "Special Topics in Arabic for Non-Native Speakers",
      "description": "This course provides the opportunity to explore new topics relevant to the study of Arabic for non-native speakers. It varies in content according to faculty expertise and the relevancy of current demands. This course is designed exclusively for degree-seeking students who hold international high school degrees with no prior Arabic language instruction, and they are enrolled in it based on placement test results.",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Arabic"],
      "source_ids": ["68feaa38b09198893aba70ab"]
    },
    {
      "id": "COURSE_ARB1201",
      "labels": ["Course"],
      "course_code": "ARB1201",
      "course_title": "Basic Standard Arabic",
      "description": "This course is for students who speak one of the Arabic varieties but have not formally studied Modern Standard Arabic. This course focuses on developing students’ skills in listening, speaking, reading, and writing in Modern Standard Arabic. At the end of this course, students will be able to read and understand short texts from newspapers, to write compositions in Arabic, and to comment on ideas in accurate Arabic. This course is designed exclusively for students who hold an International Baccalaureate or a",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Arabic"],
      "source_ids": ["68feaa38b09198893aba70ac"]
    },
    {
      "id": "COURSE_ARB1202",
      "labels": ["Course"],
      "course_code": "ARB1202",
      "course_title": "Arabic for Academic Purposes",
      "description": "This course aims to train students to use the grammar, structures, and expressions learned in high school effectively and correctly in listening, speaking, reading, and writing in academic contexts. Special emphasis is placed on the characteristics of Arabic sentence structure. This enables students to distinguish grammatical from ungrammatical usage in both writing and speaking. The main objective is to bring the student up to the level where they may be able to fully appreciate the subtleties of the Arabic language. This course is designed exclusively for students who hold an International Baccalaureate or a foreign cultural mission baccalaureate in Morocco, and they are enrolled in it based on placement test results.",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Arabic"],
      "source_ids": ["68feaa39b09198893aba70ad"]
    },
    {
      "id": "COURSE_ARB1203",
      "labels": ["Course"],
      "course_code": "ARB1203",
      "course_title": "Arabic for Communication Purposes",
      "description": "This advanced course focuses on allaspects of oral and written communication. It has three components: 1) review of the basic rules of mechanics and grammar; 2) use of selected texts to practice reading aloud, remedy speech errors, and to develop comprehension and appreciation; and 3) practice of writing in response to topic assignments. The course also provides students with the skills for interpersonal, group, and public communication and debate, and develops awareness of the importance of variations between colloquial and formal forms of language used in various Arabic-speaking countries. This course is designed exclusively for students who hold an International Baccalaureate or a foreign cultural mission baccalaureate in Morocco, and they are enrolled in it based on placement test results.",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Arabic"],
      "source_ids": ["68feaa39b09198893aba70ae"]
    },
    {
      "id": "COURSE_ARB1241",
      "labels": ["Course"],
      "course_code": "ARB1241",
      "course_title": "Arabic Literature",
      "description": "The aim of this course, taught in Arabic, is to promote the knowledge of different literary genres and to enable students to differentiate between them and to appreciate beauty in a literary work of art. Literary concepts are introduced to students and followed by reading, analysis, and discussion of works drawn from various genres. The texts are either originally written in Arabic or translated into Arabic from other languages. In addition to its literary and aesthetic value, the collection of texts used belongs to a variety of literary genres and is written by authors of diverse nationalities. This course is designed exclusively for students with a Moroccan baccalaureate or an Arabic-based high school degree from any country. However, other students whose placement test scores indicate that they have the capability to attend this course may enroll in it.",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Arabic"],
      "source_ids": ["68feaa39b09198893aba70af"]
    },
    {
      "id": "COURSE_ART1301",
      "labels": ["Course"],
      "course_code": "ART1301",
      "course_title": "Visual and Interactive Arts",
      "description": "This course introduces students to various practices in the visual and plastic arts—such as painting, drawing, sculpture, etc. Itwill also address offshoots of traditional creative practice in contemporary art that create immersive and engaging experiences for the audience. While learning to express themselves visually, students will develop proficiency with various skils, materials, and tools, taking turns focusing on different genres within the broader visual and interactive arts.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Art Appreciation & Creation"],
      "source_ids": ["68feaa39b09198893aba70b0"]
    },
    {
      "id": "COURSE_ART1302",
      "labels": ["Course"],
      "course_code": "ART1302",
      "course_title": "Design Thinking and Practice",
      "description": "The difference between art and design hinges on design being accountable to one who experiences and uses a particular creative work. Design thinking centres the user and their needs by using empathy, creativity, and interactive experimentation to find fuliling solutions to problems. The students are introduced to various stages ofthe process that engage their creative, analytical, imaginative, research, and sentimental capacities in order to produce outcomes that impact people and their environments.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Art Appreciation & Creation"],
      "source_ids": ["68feaa39b09198893aba70b1"]
    },
    {
      "id": "COURSE_ART1303",
      "labels": ["Course"],
      "course_code": "ART1303",
      "course_title": "Performing Arts and Performance Studies",
      "description": "ART 1303 Performing Arts and Performance Studies (3 SCH) This is an interdisciptinary course that explores various forms of performance such as theater, dance, ‘music and lve art while examining the cultural (political) and social contexts that shape these arts. The ‘students will be able to critically analyze and interpret performances across various cultures through ‘writing, discussions and projects, as well as engage in cultural production connected to these at forms.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Art Appreciation & Creation"],
      "source_ids": ["68feaa39b09198893aba70b2"]
    },
    {
      "id": "COURSE_ART1304",
      "labels": ["Course"],
      "course_code": "ART1304",
      "course_title": "Culture and Heritage Studies",
      "description": "ART 1304 Culture and Heritage Studies (3 SCH) This course critically engages concepts of culture and heritage from various dimensions, bringing to ight ‘how they intersect in contemporary projects of identity, expression, and reparation, and the discourses ‘of conservation and preservation. With a history Uke Morocco’s, this course will feature real-world ‘encounters with various local, national, and international projects that highlight and problemmatise these ‘concepts, and allow comparison with other contexts as well.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Art Appreciation & Creation"],
      "source_ids": ["68feaa39b09198893aba70b3"]
    },
    {
      "id": "COURSE_ART1305",
      "labels": ["Course"],
      "course_code": "ART1305",
      "course_title": "Art Histories",
      "description": "This course surveys artistic practices, art movements, and cultural forms that capture and shape the way humans experience their world. Certain works and moments in history become an occasion to delve deeper to understand the way meaning is produced in different contexts, and how the artists ‘and their audience respond to and mobilise transformation in social, cultural, economic, political, and technological realms.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Art Appreciation & Creation"],
      "source_ids": ["68feaa39b09198893aba70b4"]
    },
    {
      "id": "COURSE_ART3399",
      "labels": ["Course"],
      "course_code": "ART3399",
      "course_title": "Special Topics in Cultural Production (3 SCH) (Prerequisite: )",
      "description": "This course examines the processes, contexts, and implications of creating and disseminating cultural antifacts within contemporary society. Students explore various forms of cultural production, including visual arts, film, literature, and digital media, while analyzing the socio-political, economic, and ‘technological factors that influence these practices. Through case studies, discussions, and hands-on, projects, the course encourages students to critically engage with issues such as identity, representation, globalization, and the impact of technology on culture. By the end of the course, students will have developed a deeper understanding ofthe dynamics of cultural production and its role in shaping societal narratives.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Art Appreciation & Creation"],
      "source_ids": ["68feaa39b09198893aba70b5"]
    },
    {
      "id": "COURSE_CIP2000",
      "labels": ["Course"],
      "course_code": "CIP2000",
      "course_title": "Community Involvement Fieldwork",
      "description": "acceptable proposal for where he or she will conduct the fieldwork. PRE-REGISTRATION is REQUIRED 60 hours of fieldwork, a fieldwork report and ONE reflective roundtable lasting one hour CIP 2000 consists of a minimum -60hour service placement for and under the auspices of anon profit, nongovernmental organization or association accredited by the university or one of the university departments conducting research in a social field. Alternatively, students can propose independent community service projects either in line with the mission of a student organization they are members of or as an unaffiliated group. All placements must be approved by the CIP office before commencing. CIP 2000 can be spread out as a weekly activity throughout a semester within the local Ifrane region or as an intensive placement during a mid- or between-semester- break in sites all over Morocco and even abroad. Within this course, ‘Students will register for a roundtable, after having completed their field work, where in small groups they will reflect, share, and question their assumptions, impressions, achievements, and unforgettable moments of their community service placement. A final report is then submitted by each student that summarizes their individual placements with an orientation towards demonstrating an understanding of human development concepts.",
      "sch_credits": 0,
      "n_credits": 0,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Civic Engagement"],
      "source_ids": ["68feaa39b09198893aba70b6"]
    },
    {
      "id": "COURSE_COM1301",
      "labels": ["Course"],
      "course_code": "COM1301",
      "course_title": "Public Speaking",
      "description": "The focus of the course is to develop public speaking and group discussion skills. Students will engage in a number of public speaking activities designed to promote competency in the delivery of speeches, organization of ideas, methods of argumentation, utilization of supporting materials, selection of language, and use of narratives. Students will work in small groups and teams to do research, presentations, interviews, and interactive role-playing.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Communication"],
      "source_ids": ["68feaa39b09198893aba70b7"]
    },
    {
      "id": "COURSE_ECO1300",
      "labels": ["Course"],
      "course_code": "ECO1300",
      "course_title": "Introduction to Economics",
      "description": "This course introduces students to the essentials of both microeconomics and macroeconomics. Topics in microeconomics include supply and demand, price elasticity, producer and consumer choices, ‘and market structures. The macroeconomic section of the course will tackle gross domestic product, inflation, tabor market, monetary and fiscal policy, and international trade.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Social Sciences"],
      "source_ids": ["68feaa39b09198893aba70b9"]
    },
    {
      "id": "COURSE_ENG1301",
      "labels": ["Course"],
      "course_code": "ENG1301",
      "course_title": "English Composition I",
      "description": "This course introduces students to the essay genres of reflecting, reporting, explaining, and arguing. This involves writing several genres of academic essay following the process approach to construction, including four out-of-class essays. The expository and argumentative essays are sourced from a course reader. At least two additional essays are written in class on topics not announced in advance. Additional exercises deemed important for learning fluent and accurate writing are assigned from a course thetoric/ grammar text and other supplementary material. A semester-long project of keeping a writer's journal may be part of the instruction.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["English"],
      "source_ids": ["68feaa39b09198893aba70ba"]
    },
    {
      "id": "COURSE_ENG2301",
      "labels": ["Course"],
      "course_code": "ENG2301",
      "course_title": "Critical Thinking and Written Communication",
      "description": "This course is designed to perfect writing skills necessary to advanced undergraduate writing in the humanities and socialsciences and especially toimprove students’ abilities to write cogent argumentative prose in academic settings. It builds on the skills of clarity, coherence, and attention to audience and purpose established in ENG 1301 and COM 1301, and emphasizes the refinement of writers’ abilities to incorporate research appropriately and fluidly into texts. The course provides instruction and practice in the identification and analysis of the written and spoken argumentation of others. It includes exposure to. and practice in a variety of approaches to argumentation, including those of Aristotle, Toulmin, Habermas, and Rogers. It includes instruction in identifying and framing issues, recognizing argument styles, reading argumentation, and identifying and avoiding logical fallacies in one’s argumentation. This course is not an equivalent of the ENG 2302 or ENG 2303 courses.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["English"],
      "source_ids": ["68feaa39b09198893aba70bb"]
    },
    {
      "id": "COURSE_ENG2302",
      "labels": ["Course"],
      "course_code": "ENG2302",
      "course_title": "Writing for Business",
      "description": "This course is designed to perfect writing skills necessary to advanced undergraduate writing in SBA courses and future writing tasks in professional contexts. Building on skills learned in ENG 1301 and FAS courses, it emphasizes writers’ abilities to analyze and synthesize information and to incorporate data and opinions compellingly into texts. The two initial weeks of the course are devoted to the curriculum vitae, memos, and email communication. The five following weeks are devoted to writing case studies, and short research reports. The last half of the semester is dedicated to carrying out a research project on a subject within the business major and writing a research report: this includes writing a research proposal to precede the research project itself.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["English"],
      "source_ids": ["68feaa39b09198893aba70bc"]
    },
    {
      "id": "COURSE_ENG2303",
      "labels": ["Course"],
      "course_code": "ENG2303",
      "course_title": "Technical Writing",
      "description": "This course is designed to develop the writing skills necessary for advanced undergraduate writing in SSE courses and for future writing tasks in professional contexts. Building on skills learned in ENG 1301 and FAS courses, it emphasizes writers’ abilities to analyze and synthesize information and to incorporate them into concise and clear texts. Students will write resumes, cover letters, memorandums, reports, professional emails, and a final research paper. In the context of these or in separate assignments, they will practice rhetorical approaches, such as process instruction, process analysis, comparison-contrast, classification, and definition. The last half of the semester requires the writing of a research paper on an approved academic topic, beginning with the submission of a research proposal at the start of the research process.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["English"],
      "source_ids": ["68feaa39b09198893aba70bd"]
    },
    {
      "id": "COURSE_ENG2320",
      "labels": ["Course"],
      "course_code": "ENG2320",
      "course_title": "Creative Writing",
      "description": "In this course, students will immerse themselves in the work of reading and writing, and create their ‘own community of writers. Students willread a navel and a wide variety of short stories and poems and discuss them. As the course progresses, students will examine how craft transforms the source material {or writing, how working at the craft of writing rings raw instinct and critical understandingiinto some sort ‘of equilibrium.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Art Appreciation & Creation"],
      "source_ids": ["68feaa39b09198893aba70be"]
    },
    {
      "id": "COURSE_FAS0210",
      "labels": ["Course"],
      "course_code": "FAS0210",
      "course_title": "Strategic Academic Skills",
      "description": "This course offers basic study skills and information literacy skills preparing students for academic success at AUI. Students are trained to take responsibility for their own learning through tasks that require them to reflect on, as well as evaluate, their current study habits, and to implement new strategies that improve their learning. Students are also introduced to the Information Literacy Skills necessary to communicate effectively in online, classroom, academic, and group contexts. These skills include being able to locate, evaluate, synthesize, and present information efficiently and effectively. They learn and practice the principles of effective academic research and demonstrate their mastery in a final project. This course can be waived upon successful completion of a placement test or upon meeting portfolio requirements.",
      "sch_credits": 0,
      "n_credits": 2,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Foundations for Academic Success"],
      "source_ids": ["68feaa39b09198893aba70bf"]
    },
    {
      "id": "COURSE_FAS1220",
      "labels": ["Course"],
      "course_code": "FAS1220",
      "course_title": "Introduction to Critical Thinking",
      "description": "This course is designed to develop students’ understanding of the critical thinking",
      "sch_credits": 2,
      "n_credits": 2,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Foundations for Academic Success"],
      "source_ids": ["68feaa39b09198893aba70c0"]
    },
    {
      "id": "COURSE_FRN3310",
      "labels": ["Course"],
      "course_code": "FRN3310",
      "course_title": "Advanced French Writing and Speaking Skills",
      "description": "This course is for students completely at ease using all four language skills in French. The course develops and improves students’ ability to express themselves in correct standard French, both written and spoken, using authentic materials drawn from the world of business, the press, and other media. A particular emphasis is put on the necessary tools that enable students to give power, coherence, and. polish to the numerous presentations they will be asked to give in their professional life. This course can be taken as an elective.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["French"],
      "source_ids": ["68feaa39b09198893aba70c1"]
    },
    {
      "id": "COURSE_FYE1101",
      "labels": ["Course"],
      "course_code": "FYE1101",
      "course_title": "First-Year Seminars",
      "description": "First-Year Seminars ‘Throughout their first year, all Incoming students will enroll in a Pass/Fail, one-credit Seminar (FYE 1101 during the first semester and FYE 1102 during the second one) and will also be paired with a peer mentor for their first semester to provide them with guidance, advice, feedback, and support during this new journey. The FYE Seminars consist of a series of informative forums developed through collaboration between the Division of Student Affairs and Academic Affairs. Incoming students will be charged 2500 MAD to cover orientation and program fees. Additionally, they will pay 2100 MAD for each of the one-credit Seminars.",
      "sch_credits": 1,
      "n_credits": 1,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["First Year Experience"],
      "source_ids": ["68feaa39b09198893aba70c2"]
    },
    {
      "id": "COURSE_FYE1102",
      "labels": ["Course"],
      "course_code": "FYE1102",
      "course_title": "First-Year Seminars",
      "description": "First-Year Seminars ‘Throughout their first year, all Incoming students will enroll in a Pass/Fail, one-credit Seminar (FYE 1101 during the first semester and FYE 1102 during the second one) and will also be paired with a peer mentor for their first semester to provide them with guidance, advice, feedback, and support during this new journey. The FYE Seminars consist of a series of informative forums developed through collaboration between the Division of Student Affairs and Academic Affairs. Incoming students will be charged 2500 MAD to cover orientation and program fees. Additionally, they will pay 2100 MAD for each of the one-credit Seminars.",
      "sch_credits": 1,
      "n_credits": 1,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["First Year Experience"],
      "source_ids": ["68feaa3ab09198893aba70c3"]
    },
    {
      "id": "COURSE_HIS1301",
      "labels": ["Course"],
      "course_code": "HIS1301",
      "course_title": "History of the Arab World",
      "description": "consideration the perspectives of history and related fields of inquiry. It takes a social and cultural approach to understanding the different histories of Arab society. The course attempts to balance political history and its focus on regimes and main events with long-term social and cultural transformations that are relevant to the ordinary peoples of the Arab world.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["History or Political Science"],
      "source_ids": ["68feaa3ab09198893aba70c5"]
    },
    {
      "id": "COURSE_HUM1310",
      "labels": ["Course"],
      "course_code": "HUM1310",
      "course_title": "History and Culture of the Amazigh",
      "description": "The purpose of this course is to provide students with insight into the specifics of Amazigh (Berber) culture and institutions, starting with a background survey covering the origins, distribution, and common history of the Amazigh peoples of North Africa from ancient history, up to medieval times. The focus then shifts to Morocco, covering events from the Almohad period to the present time, with emphasis on Amazigh resistance during the colonial period, together with an analysis of current problems confronting the Amazigh community in this country, with special reference to the Middle Atlas region. Time is also devoted to the study of the various Amazigh-speaking areas of Morocco, Amazigh toponyms, and English translations of oral texts (folktales, proverbs, epic and lyrical verse, riddles, etc...).",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["History or Political Science"],
      "source_ids": ["68feaa3ab09198893aba70c7"]
    },
    {
      "id": "COURSE_HUM2302",
      "labels": ["Course"],
      "course_code": "HUM2302",
      "course_title": "Islamic Societies",
      "description": "Using an interdisciplinary approach, this course introduces students to the historical and contemporary study of Islamic societies. Students explore a variety of topics including history, theology, mysticism, architecture, archeology, political theory, literature, and the fine arts, to gain an appreciation for the vast array of peoples, places, ideas, and things that all gather under the umbrella of “Islam.” Rather than a comprehensive course in the history of Islam, the course varies depending on the semester and instructor, who emphasizes different historical and/or contemporary themes.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["History or Political Science"],
      "source_ids": ["68feaa3ab09198893aba70c9"]
    },
    {
      "id": "COURSE_HUM2305",
      "labels": ["Course"],
      "course_code": "HUM2305",
      "course_title": "Science and Society",
      "description": "This course serves to provide an understanding both of science as an intellectual endeavor and of the contemporary world, which is a world increasingly shaped by science. The course directly addresses a number of key questions: What is science? What is the nature of scientific knowledge? What is the relationship between scientific knowledge and other kinds of knowledge or belief, between science and technology, between science and power? Are scientists morally responsible for the applications and effects of their scientific research?",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Humanities"],
      "source_ids": ["68feaa3ab09198893aba70ca"]
    },
    {
      "id": "COURSE_HUM2306",
      "labels": ["Course"],
      "course_code": "HUM2306",
      "course_title": "Comparative Religion",
      "description": "This course is an introduction to the study of the world’s major religions: Islam, Christianity, Judaism, Buddhism, and Hinduism. Other, lesser-known religions and religious movements are also discussed. The course covers the ideas and concepts that have shaped religions, as well as the questions that they have sought to address, with an emphasis on those themes shared by all of them. Students gain a better",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Humanities"],
      "source_ids": ["68feaa3ab09198893aba70cb"]
    },
    {
      "id": "COURSE_HUM2307",
      "labels": ["Course"],
      "course_code": "HUM2307",
      "course_title": "History of Islamic Technology",
      "description": "This introductory humanities course is a survey of technological advances in the Middle East and North Africa in the pre-modern era. While some of these advances came about as a response to the requirements of religion (e.g., determination of the qibla direction and of prayer times), many others were practical solutions to harness the forces of nature and lead a better-quality life. Two major themes of the course are 1) to show the intellectual and technological exchanges through translations, trade, and travel between Muslims and their neighbors, and 2) to link the technologies under study to current issues by showing how past experiences and technological solutions (e.g., water use, architectural techniques, etc.) can be applied for sustainable cultural and economic development, in the MENA region and in Morocco in particular. The course consists of a series of lectures, field trips, and video projections. No prior knowledge of Islam and its civilization is required to take the course. The course can be taken as an elective in any undergraduate program.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Humanities"],
      "source_ids": ["68feaa3ab09198893aba70cc"]
    },
    {
      "id": "COURSE_LIT3370",
      "labels": ["Course"],
      "course_code": "LIT3370",
      "course_title": "Aesthetics",
      "description": "and visual and plastic arts. Students also will critically examine and discuss various contemporary debates in Western aesthetics focusing on the relation between art and society. The debates revolve around the following themes: art and ethics, the influence of art on politics (and vice versa), art and violence, art and fashion, and art and technology in everyday life.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Art Appreciation & Creation"],
      "source_ids": ["68feaa3ab09198893aba70ce"]
    },
    {
      "id": "COURSE_PHI2301",
      "labels": ["Course"],
      "course_code": "PHI2301",
      "course_title": "Philosophical Thought",
      "description": "This course is an introduction to Philosophy. It examines the principal themes of philosophical inquiry (e.g., metaphysics, theory of knowledge, ethics, politics, aesthetics, etc.) from both a historical and multicultural perspective. Insofar as philosophy is central to human life, its history, in different places, records the efforts of many to understand the world and our place in it. The study of philosophy therefore contributes to an understanding of some of the ideas that have shaped and that continue to shape human life even as it teaches one how to think critically about them.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Humanities"],
      "source_ids": ["68feaa3ab09198893aba70cf"]
    },
    {
      "id": "COURSE_PHI2302",
      "labels": ["Course"],
      "course_code": "PHI2302",
      "course_title": "History of Ideas",
      "description": "This course examines influential ideas in distinct areas of thought and from diverse intellectual traditions. Itanalyzes such ideas within a historical context, tracing their origin and development in different places and times. It considers the contributions of specific individuals (eg., Plato, Siddartha Gautama, Ibn Rushd, Descartes, Kant, Darwin, Nietzsche, Freud, etc.), the impact of various intellectual movements (eg, the Enlightenment, Romanticism, Post-modernism, etc.), and how both of these have manifested themselves in different domains of thought (e.g., philosophy, religion, ethics, politics, science, the arts, etc.). The course provides students with a greater understanding of the ideas that have shaped and that continue to shape our reality.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Humanities"],
      "source_ids": ["68feaa3ab09198893aba70d0"]
    },
    {
      "id": "COURSE_PSY1301",
      "labels": ["Course"],
      "course_code": "PSY1301",
      "course_title": "Introduction to Psychology",
      "description": "This course is an introductory survey of the major content areas and theoretical models of psychology ‘emphasizing the scientific approach to critically understand human behavior. Throughout the course, ‘behavior is examined as the product of interaction between our biology, our culture, and our unique individual abilities. Students gain an understanding of human development, consciousness, learning, ‘memory, intelligence, emotions, and personality, among other main focuses of psychology.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Social Sciences"],
      "source_ids": ["68feaa3ab09198893aba70d2"]
    },
    {
      "id": "COURSE_SLP1101",
      "labels": ["Course"],
      "course_code": "SLP1101",
      "course_title": "Service Learning",
      "description": "Service Learning (SL) is a course-based, credit-bearing educational experience thst allows and (b) reflect on the service activity in such a way as to gain further understanding of course In addition to enhancing learning for students, the SL component of the course is equally required. The learning part is about learning as much as possible from the site based on course coverage and insights. Students are required to keep a reflective journal about what goes on at the SL site. In addition to their on-site experience, students are expected to share their observations about the course content in terms of theory and practice.",
      "sch_credits": 1,
      "n_credits": 1,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Civic Engagement"],
      "source_ids": ["68feaa3ab09198893aba70d3"]
    },
    {
      "id": "COURSE_SOC1301",
      "labels": ["Course"],
      "course_code": "SOC1301",
      "course_title": "Principles of Sociology",
      "description": "This course provides an introduction to sociology by covering a range of objects of sociological investigation, including socialization, deviance, social stratification, family, gender, race, and ethnicity. also introduces students tothe scope, approach, research methods, and ethical concerns of sociological inquiry.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Social Sciences"],
      "source_ids": ["68feaa3ab09198893aba70d4"]
    },
    {
      "id": "COURSE_SSC1310",
      "labels": ["Course"],
      "course_code": "SSC1310",
      "course_title": "‘ Introduction to Anthropology",
      "description": "This course is an introduction to the principles and processes of Cultural Anthropology with an emphasis ‘on Applied Anthropology. The course has a strong theoretical base linking social, economic, and political organizations to wider considerations of environment and culture. Students are introduced to the main ‘ethnographic methods and are required to use more than one of them in a field exercise, Students are ‘encouraged to make connections between materials presented in class and the realities of life in the MENA region with an emphasis on Morocco's National Human Development Initiative. Students are also introduced to ethical issues of data collection and data analysis in the Social Sciences.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Social Sciences"],
      "source_ids": ["68feaa3ab09198893aba70d5"]
    },
    {
      "id": "COURSE_BIO1401",
      "labels": ["Course"],
      "course_code": "BIO1401",
      "course_title": "Principles of Biology",
      "description": "This course is an introduction to the basic concepts of living organisms: the cell, metabolic activities, reproduction and genetics, DNA and evolution.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Sciences"],
      "source_ids": ["68feaa3ab09198893aba70d6"]
    },
    {
      "id": "COURSE_BIO1402",
      "labels": ["Course"],
      "course_code": "BIO1402",
      "course_title": "Environmental Biology II",
      "description": "This course is designed to serve students from all majors. It requires no prerequisite. This course offers a study of molecular genetics and the diversity of structure and function in living form. Special attention is paid to the ecological, behavioral, and environmental relationships of living creatures in the modern world. A two-hour laboratory supports the lecture material.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Sciences"],
      "source_ids": ["68feaa3bb09198893aba70d7"]
    },
    {
      "id": "COURSE_CHE1401",
      "labels": ["Course"],
      "course_code": "CHE1401",
      "course_title": "General Chemistry I",
      "description": "This course starts with the basics of chemistry and chemical reactions. It then gives an insight into the structure of matter and the origin of chemical periodicity. The course provides an introduction to the fundamentals of atomic structure, the periodic table, nomenclature, chemical equations and solutions. The concepts of chemical bonding and molecular structure are also developed.\nThe laboratory sessions are designed to reinforce the lecture material and to allow students to become familiar with the experimental procedures used in chemistry.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Sciences"],
      "source_ids": ["68feaa3bb09198893aba70d8"]
    },
    {
      "id": "COURSE_EGR2302",
      "labels": ["Course"],
      "course_code": "EGR2302",
      "course_title": "Engineering Economics",
      "description": "This course covers the time value of economic resources, engineering project investments analysis, and the effect of taxes on engineering project decisions. Students learn about societal, technical, economic, environmental, political, legal, and ethical analyses of project alternatives.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["GenEd"],
      "disciplines": ["Social Sciences"],
      "source_ids": ["68feaa3bb09198893aba70d9"]
    },
    {
      "id": "COURSE_MTH1303",
      "labels": ["Course"],
      "course_code": "MTH1303",
      "course_title": "Calculus I: Differential and Integral Calculus",
      "description": "The emphasis of this course is on problem solving, not on the presentation of theoretical considerations. While the course necessarily includes some discussion of theoretical notions, its primary objective is not the production of theorem-provers. The syllabus for MTH 1303 includes most of the elementary topics in the theory of real-valued functions of a real variable: limits, continuity, derivatives, maxima and minima, integration, trigonometric, logarithmic, and exponential functions and techniques of integration.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Mathematics"],
      "source_ids": ["68feaa3bb09198893aba70da"]
    },
    {
      "id": "COURSE_MTH1304",
      "labels": ["Course"],
      "course_code": "MTH1304",
      "course_title": "Discrete Mathematics for Engineers",
      "description": "This course is an introduction to the fundamental ideas of discrete mathematics. Topics covered in this course include logic, sets, relations, function, number representation, graphs, and counting techniques and their applications to probabilistic reasoning. The aim of the course is to give the students a foundation for the development of more advanced mathematical concepts that are used in computer science and engineering.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Mathematics"],
      "source_ids": ["68feaa3bb09198893aba70db"]
    },
    {
      "id": "COURSE_MTH2301",
      "labels": ["Course"],
      "course_code": "MTH2301",
      "course_title": "Calculus II: Multivariable Calculus",
      "description": "Multivariable calculus covers vectors and surfaces, partial differentiation, multiple integration, and vector calculus, including Green's theorem and Stokes' Theorem.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Mathematics"],
      "source_ids": ["68feaa3bb09198893aba70dc"]
    },
    {
      "id": "COURSE_MTH2320",
      "labels": ["Course"],
      "course_code": "MTH2320",
      "course_title": "Linear and Matrix Algebra",
      "description": "Students are introduced to: vectors in R2 and R3, matrices and vectors; systems of linear equations, spanning sets, linear independence, linear transformations and matrix operators; LU decomposition of a matrix, determinants, subspaces, basis and dimension; coordinate systems and change of coordinates; eigenvalues and eigenvectors; orthogonality and orthogonal matrices; and applications of linear algebra to some computing and engineering problems.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Mathematics"],
      "source_ids": ["68feaa3bb09198893aba70dd"]
    },
    {
      "id": "COURSE_MTH3301",
      "labels": ["Course"],
      "course_code": "MTH3301",
      "course_title": "Probability and Statistics for Engineers",
      "description": "This course is a calculus-based introduction to probability and statistics with a focus on techniques and applications most relevant to engineering. Topics include basic probability, conditional probability, independence of events, random variables, cumulative distribution functions, density functions, expectation, variance and covariance, independence of events and random variables, common discrete and continuous distributions, Law of Large Numbers, the Central Limit Theorem, and an introduction to descriptive statistics and sampling distributions.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Mathematics"],
      "source_ids": ["68feaa3bb09198893aba70de"]
    },
    {
      "id": "COURSE_PHY1401",
      "labels": ["Course"],
      "course_code": "PHY1401",
      "course_title": "Physics I",
      "description": "This course provides engineering students with the basic knowledge of mechanics and vibration required for the advanced engineering course. Theoretical and experimental concepts covered include physical quantities, linear motion, Newton’s law of motion, work, energy, momentum, systems in equilibrium, periodic motion, elasticity, fluid mechanics, the universal law of gravitation, the general form of gravitational potential energy, temperature and thermal expansion.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Sciences"],
      "source_ids": ["68feaa3bb09198893aba70df"]
    },
    {
      "id": "COURSE_PHY1402",
      "labels": ["Course"],
      "course_code": "PHY1402",
      "course_title": "Physics II",
      "description": "This course is a continuation of General Physics I (Phy1401), it provides you with fundamental knowledge of:\n• Electricity, and magnetism required in follow up-courses in electric circuits, electromagnetism, communications, and sensor systems.\n• Sound waves required in conversion to electrical signals.\n• Optics required in follow-up courses in electromagnetism, communications, and sensor systems.\n• Theoretical and experimental topics include wave productions and propagation, standing waves, wave effects, sound, electric fields and forces, electromagnetic induction, AC circuits, light, optical systems, interference, and diffraction.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": ["Sciences"],
      "source_ids": ["68feaa3bb09198893aba70e0"]
    },
    {
      "id": "COURSE_CSC1401",
      "labels": ["Course"],
      "course_code": "CSC1401",
      "course_title": "Computer Programming",
      "description": "This course covers algorithms and problem solving, basic algorithmic analysis, fundamental programming constructs and data structures, and basic algorithmic strategies. Students will learn the basic skills of constructing a problem solution and will illustrate this in labs with a high-level language (currently C). Students will also be introduced to different aspects of ethics in Computer Science.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa34b09198893aba706a"]
    },
    {
      "id": "COURSE_CSC2302",
      "labels": ["Course"],
      "course_code": "CSC2302",
      "course_title": "Data Structures",
      "description": "This course will build on the knowledge and skills acquired in the introductory programming course. It covers different types of data structures (lists, queues, graphs, etc.) and the associated algorithms, emphasizing memory vs. CPU tradeoffs.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa34b09198893aba706b"]
    },
    {
      "id": "COURSE_CSC2305",
      "labels": ["Course"],
      "course_code": "CSC2305",
      "course_title": "Computer Organization and Architecture",
      "description": "This course provides a discussion of the fundamentals of computer organization and architecture and relates it to contemporary design issues. Students will gain an understanding of the basic structure and operation of a digital computer. Topics include digital logic, instruction set architecture, computer arithmetic, architectural CPU design, and functional computer organization. Besides emphasizing the fundamental concepts, the course will discuss the critical role of performance in driving computer design.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa35b09198893aba706c"]
    },
    {
      "id": "COURSE_CSC2306",
      "labels": ["Course"],
      "course_code": "CSC2306",
      "course_title": "Object Oriented Programming",
      "description": "This course will build on the broad understanding acquired in the previous programming courses to allow students to scale-up and be able to solve more complex problems through object-oriented methodology. The object-oriented paradigm encapsulates code complexity within objects and integrates features such as abstraction, cohesion, encapsulation, information hiding, inheritance, and polymorphism. The object- oriented approach emphasizes software qualities such as robustness, maintainability, extensibility, and reusability principles into software development. Students will gain experience building object-oriented software solutions using the Unified Modeling Language (UML) and the Java programming language.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa35b09198893aba706d"]
    },
    {
      "id": "COURSE_CSC3309",
      "labels": ["Course"],
      "course_code": "CSC3309",
      "course_title": "Introduction to Artificial Intelligence",
      "description": "The course provides students with the concepts and knowledge to design intelligent agents by leveraging the main skills of Al programming, namely searching for goals and planning, knowledge representation, logical and probabilistic inferencing, data learning from experience. Students will also be introduced to Computer Vision (CV) and Natural Language Processing (NLP) pipelines.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": [
        "Computer Science",
        "Artificial Intelligence",
        "Advanced Computer Science"
      ],
      "source_ids": [
        "68feaa35b09198893aba706e",
        "68feaa36b09198893aba7082",
        "68fec7fc900a1bff5afca2b4"
      ]
    },
    {
      "id": "COURSE_CSC3315",
      "labels": ["Course"],
      "course_code": "CSC3315",
      "course_title": "Languages and Compilers",
      "description": "This course examines computer languages from the perspective of translation and the computational models they implement. The first half of the course reviews the evolution of languages, language design principles, and evaluation criteria, then presents the processing stages, theoretical concepts, and tools associated with language translation. The second half of the course introduces languages representing different programming paradigms and examines runtime handling of selected language features.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa35b09198893aba706f"]
    },
    {
      "id": "COURSE_CSC3323",
      "labels": ["Course"],
      "course_code": "CSC3323",
      "course_title": "Analysis of Algorithms",
      "description": "This course covers the study of algorithm design, including introductory concepts: sorting and searching algorithms; string, graph, and set algorithms; complexity classes; branch and bound algorithms; dynamic programming, and advanced topics.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa35b09198893aba7070"]
    },
    {
      "id": "COURSE_CSC3324",
      "labels": ["Course"],
      "course_code": "CSC3324",
      "course_title": "Software Engineering",
      "description": "Software Engineering is the application of engineering principles and techniques to the process of software development, delivery, maintenance, and decommission. Its purpose is to make the building of software systems formal and predictable, while delivering high quality software products that comply with client requirements and expectations. The main goal of this course is to learn how to build Professional Software, in a Business Environment, using a formal development framework/methodology, and to develop the necessary skills of Modeling, Analysis and Design, including System Architecture and Technology Stack issues, necessary to this end.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa35b09198893aba7071"]
    },
    {
      "id": "COURSE_CSC3326",
      "labels": ["Course"],
      "course_code": "CSC3326",
      "course_title": "Database Systems",
      "description": "The course covers the design and implementation of Relational databases. While significant focus is placed on Entity-Relationship and Relational modeling, other models and current trends in database are introduced. Relational Algebra and SQL are covered, including procedural SQL. A Relational DBMS is used along with database application development as lab work and class projects. Transactions and concurrency issues are also addressed.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa35b09198893aba7072"]
    },
    {
      "id": "COURSE_CSC3328",
      "labels": ["Course"],
      "course_code": "CSC3328",
      "course_title": "Embedded Systems",
      "description": "This course surveys the application of computing systems in a range of devices ranging from nomadic devices to embedded real-time computers. Emphasis will be on developing applications for these platforms with stringent constraints such as low memory, limited power, limited processing power, no persistent storage capability, etc.An integral part of this course is the implementation of a system on one of the existing platforms, such as VxWorks, with a real time and mobility flavor.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": ["Computer Science", "Computer Systems"],
      "source_ids": ["68feaa35b09198893aba7073", "68feaa36b09198893aba7085"]
    },
    {
      "id": "COURSE_CSC3329",
      "labels": ["Course"],
      "course_code": "CSC3329",
      "course_title": "loT & Big Data Streaming",
      "description": "This course introduces students to the Internet of Things (loT) world and technological trends. It covers loT specific requirements and challenges, reference architecture, components and protocols, as well as state of the art loT cloud platforms and architectural patterns. As loT is a main source of big data, this course also addresses the cloud technologies and services necessary to support big data streaming and processing. TinyML technology is integrated in the course as well, to enable students to know about embedded machine learning.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": [
        "Computer Science",
        "Computer Systems",
        "Big Data Analytics"
      ],
      "source_ids": [
        "68feaa35b09198893aba7074",
        "68feaa36b09198893aba7086",
        "68fec934900a1bff5afca2b5"
      ]
    },
    {
      "id": "COURSE_CSC3331",
      "labels": ["Course"],
      "course_code": "CSC3331",
      "course_title": "Introduction to Big Data Environment and Application",
      "description": "The course introduces Big Data management and techniques that can be applied to massive datasets in distributed environments. The course covers the Map-Reduce parallel computing paradigm and Hadoop distributed file system. The course reviews data storage and preparation for applications, including some machine learning algorithms used for mining knowledge in datastores, including NoSQL.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": [
        "Computer Science",
        "Computer Systems",
        "Big Data Analytics"
      ],
      "source_ids": [
        "68feaa35b09198893aba7075",
        "68feaa36b09198893aba7087",
        "68fec79f900a1bff5afca2b3"
      ]
    },
    {
      "id": "COURSE_CSC3346",
      "labels": ["Course"],
      "course_code": "CSC3346",
      "course_title": "Data Engineering and Visualization",
      "description": "This course covers two independent, but complementary parts, namely data engineering and data visualization. In the first part we will cover data engineering, which is a prerequisite to any data science/analytics project. We will explore various ways in building and maintaining data architectures for ingestion and processing, as well as ways for ensuring that there is uninterrupted flow/pipeline of data between servers and analytics applications. This includes moving data around, integrating new data sources, building data collection pipelines, among various other things using ETL (Extract, Transform and Load) tools.\nThe second part will cover the art and science of turning data into readable graphics. We will explore how to design and create data visualizations based on data available and business objectives. This includes data modeling, basic data processing, such as aggregation and filtering, mapping data attributes to graphical attributes, and strategic visual encoding based on known properties of visual perception as well as the task(s) at hand. Students will learn how to use Open Source data visualization tools, such as D3.js.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": ["Computer Science", "Big Data Analytics"],
      "source_ids": ["68feaa36b09198893aba7076", "68feaa36b09198893aba7088"]
    },
    {
      "id": "COURSE_CSC3351",
      "labels": ["Course"],
      "course_code": "CSC3351",
      "course_title": "Operating Systems",
      "description": "This course introduces students to fundamental concepts of operating systems. It emphasizes structures, key design issues, as well as the fundamental principles behind modern operating systems. It covers concurrency, scheduling, memory and device management, file systems, and scripting. The course uses implementations of Unix-like and Windows systems to illustrate some concepts.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa36b09198893aba7077"]
    },
    {
      "id": "COURSE_CSC3371",
      "labels": ["Course"],
      "course_code": "CSC3371",
      "course_title": "Computer Communications and Networks",
      "description": "3 hours weekly lecture with an embedded lab component. This course covers topics in data communications of interest to computing majors, such as types of LAN, VLAN, MAN, and WAN networks, with their corresponding access methods and link layer protocols. The course then moves on to cover the TCP/IP protocol stack, including IP functions such as addressing, routing, congestion control, and Transport layer function, such as reliable transmission and flow control. The course culminates in the coverage of major Internet enabling services and application layer protocols, namely DNS, SMTP, and HTTP.This course covers topics in data communications of interest to computing majors, such as types of LAN, VLAN, MAN, and WAN networks, with their corresponding access methods and link layer protocols. The course then moves on to cover the TCP/IP protocol stack, including IP functions such as addressing, routing, congestion control, and Transport layer function, such as reliable transmission and flow control. The course culminates in the coverage of major Internet enabling services and application layer protocols, namely DNS, SMTP, and HTTP. ",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa36b09198893aba7078"]
    },
    {
      "id": "COURSE_CSC3373",
      "labels": ["Course"],
      "course_code": "CSC3373",
      "course_title": "Cloud Computing",
      "description": "The course focuses on the fundamentals of Cloud Computing technology and provides a broad understanding of the different enabling technologies, e.g., Virtualization and Distributed Systems. Topics include concepts and architecture, standards, implementation strategies, Software as a Service (SaaS), Platform as a Service (PaaS), Infrastructure as a Service (laaS), software defined networks and storage, cloud storage, and programming models. We will also discuss the motivating factors, benefits and challenges of the cloud, as well as service models, service level agreements (SLAs), security, examples of cloud service providers and use cases.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": ["Computer Science", "Computer Systems"],
      "source_ids": ["68feaa36b09198893aba7079", "68feaa37b09198893aba708e"]
    },
    {
      "id": "COURSE_CSC3374",
      "labels": ["Course"],
      "course_code": "CSC3374",
      "course_title": "Advanced and Distributed Programming Paradigms",
      "description": "This course provides theoretical knowledge about, and practical skills in advanced programming paradigms. It builds on the background acquired in introductory programming courses and other prerequisite courses to tackle programming models used in professional, enterprise-grade software development. Covered topics are organized into five parts, where each build on previous ones:\n• Part I. Programming for communication: Client/server model and programming\n• Part II. Programming for integration: Service-oriented model and programming\n• Part III. Programming for performance: Multithreaded and asynchronous programming\n• Part IV. Programming for extensibility: Functional and reactive programming\n• Part V. Programming for scalability: Distributed and parallelized programming.\nThis course adopts the 3 most popular programming languages: Python, JavaScript, and Java. Each time, it uses the most suitable language(s) to support and illustrate the concepts covered in each part.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa36b09198893aba707a"]
    },
    {
      "id": "COURSE_CSC3376",
      "labels": ["Course"],
      "course_code": "CSC3376",
      "course_title": "Systems Programming",
      "description": "This course teaches students how to build, debug, and test large computer programs. The course stresses learning how to use tools such as debuggers, profilers, source version control systems, and integrated development environments as an essential part of developing large programs. The course also stresses the understanding of how programs execute on today’s computers and how to measure and optimize performance.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": ["Computer Science", "Computer Systems"],
      "source_ids": ["68feaa36b09198893aba707b", "68feaa37b09198893aba708f"]
    },
    {
      "id": "COURSE_CSC4307",
      "labels": ["Course"],
      "course_code": "CSC4307",
      "course_title": "Agile Software Engineering and DevOps",
      "description": "This course focuses on agility in software engineering: its values, principles, roles, practices, frameworks, and tools. It compares agile software development against traditional phase-based methodologies, such as Waterfall, to showcase the benefits of agility in modern software development. As core agile practices, Continuous Integration and Continuous Delivery (CI/CD) are emphasized. Furthermore, various state-of- the-art agile software development frameworks, such as Scrum and XP, are presented. Students will have the opportunity to apply agile software development and integrate it to DevOps by using its supporting tools, technologies, and cloud services in the context of a team-based software project. Technologies include containerization systems, such as Docker, as well as orchestration platforms. Additionally, students will be introduced to various automated testing frameworks and techniques. Cloud services will be leveraged at the infrastructure, platform, and software levels ensuring a holistic learning experience.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": ["Computer Science", "Software Engineering"],
      "source_ids": ["68feaa36b09198893aba707c", "68feaa37b09198893aba7092"]
    },
    {
      "id": "COURSE_CSC4308",
      "labels": ["Course"],
      "course_code": "CSC4308",
      "course_title": "Cyber Security",
      "description": "This course introduces the students to the computing perspective of cybersecurity. It focuses on the role of cryptography in data and network security on the one hand and access control on the other. As such, the course covers the principles behind secret key encryption algorithms such as AES and message authentication functions (SHA-XXX, CMAC, HMAC), public key encryption (RSA, Diffie-Hellman, Elliptic curve cryptography), key management, and digital signatures. It introduces PKI and [AAA mechanisms for access control. Students are also introduced to security protocols such as TLS and IPsec.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": ["Computer Science", "Advanced Computer Science"],
      "source_ids": ["68feaa36b09198893aba707d", "68feaa37b09198893aba7093"]
    },
    {
      "id": "COURSE_CSC4351",
      "labels": ["Course"],
      "course_code": "CSC4351",
      "course_title": "Statistical Analysis",
      "description": "This course provides statistical methods and tools for analytics, helping students in applying them for purposes of data analysis, hypothesis testing, and building prediction and forecasting models.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": ["Computer Science", "Big Data Analytics"],
      "source_ids": ["68feaa36b09198893aba707e", "68feaa37b09198893aba7095"]
    },
    {
      "id": "COURSE_CSCS3359",
      "labels": ["Course"],
      "course_code": "CSCS3359",
      "course_title": "Software Testing and Analysis",
      "description": "This course presents an overview of the principles and practices of software testing. It covers different concepts and techniques on how to test software. Topics include various testing methods such as structural and functional testing; various testing approaches such as unit, integration, regression and system testing. Students will also be introduced to manual and automatic techniques for generating test cases.\nThe objective of this course is to emphasize the importance of testing, and to prepare students to test software in an organized and systematic way. This course will provide theoretical and practical knowledge, as well as current research on software testing. Upon completion of the course, students will be capable of planning and applying various testing techniques and strategies for testing software.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Computer_Science", "Specialization"],
      "disciplines": ["Computer Science", "Software Engineering"],
      "source_ids": ["68feaa36b09198893aba707f", "68feaa37b09198893aba7097"]
    },
    {
      "id": "COURSE_EGR4300",
      "labels": ["Course"],
      "course_code": "EGR4300",
      "course_title": "Internship",
      "description": "This course consists of on-the-job education and training in a public or private sector agency or business related to the student’s major. Students must consult with the internship director to arrange for a three-party contract to be drawn up that details the amount and nature of the work to be done. The contract (Contrat de Stage) must be signed by the student, the internship director, and the agency or businessperson supervising the work before work begins. Completion of the UCC Arabic/French language requirement is strongly recommended before this experience. May be combined with EGR 4402 for 7 SCH with approval.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa36b09198893aba7080"]
    },
    {
      "id": "COURSE_EGR4402",
      "labels": ["Course"],
      "course_code": "EGR4402",
      "course_title": "Capstone Design",
      "description": "This course is to be taken during the last regular semester of enrollment. This project-design course aims to consolidate the information gathered in all previous courses, identifying appropriate standards, and incorporating realistic constraints. The content will vary and will take into account the technical electives and optional engineering courses selected.",
      "sch_credits": 4,
      "n_credits": 4,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Computer_Science"],
      "disciplines": ["Computer Science"],
      "source_ids": ["68feaa36b09198893aba7081"]
    },
    {
      "id": "COURSE_CSC3310",
      "labels": ["Course"],
      "course_code": "CSC3310",
      "course_title": "Artificial Neural Networks",
      "description": "This course defines biological, physical, and different mathematical models for Artificial Neural Networks (ANN), compares these models, and investigates the relationship between neural network learning and symbolic learning methods. Consideration is given to the relevance of these different issues when ANN’s are applied to problem-solving.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Artificial Intelligence"],
      "source_ids": ["68feaa36b09198893aba7083"]
    },
    {
      "id": "COURSE_CSC3311",
      "labels": ["Course"],
      "course_code": "CSC3311",
      "course_title": "Computer Vision",
      "description": "This course provides an introduction to computer vision including fundamentals of image formation, camera imaging geometry, feature detection and matching, stereo, motion estimation and tracking, image classification and scene understanding. The course will explore methods for depth recovery from stereo images, camera calibration, automated alignment, tracking, boundary detection, and recognition using both classical machine learning and deep learning approaches.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Artificial Intelligence"],
      "source_ids": ["68feaa36b09198893aba7084"]
    },
    {
      "id": "COURSE_CSC3347",
      "labels": ["Course"],
      "course_code": "CSC3347",
      "course_title": "Machine Learning and Data Mining",
      "description": "The course covers the most popular machine learning algorithms used for discovering meaningful patterns and knowledge from large amounts of data, including Artificial Neural Networks, Decision Trees, Association Rule Mining, Clustering algorithms, K-Nearest Neighbor approaches, etc.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Specialization"],
      "disciplines": ["Artificial Intelligence"],
      "source_ids": ["68feaa36b09198893aba7089"]
    },
    {
      "id": "COURSE_CSC3348",
      "labels": ["Course"],
      "course_code": "CSC3348",
      "course_title": "Natural Language Processing and Text Mining",
      "description": "Natural Language Processing (NLP) is the field of modeling and processing linguistic information. This field is extremely multidisciplinary; therefore, the course will include some ideas central to Linguistics (morphology, syntax, semantics), and to modeling (probabilistic models, machine learning models). In recent years, deep learning approaches have obtained very high performance in NLP. Hence, besides investigating the fundamental concepts, students will gain an introduction to the cutting-edge neural network algorithms that have revolutionized the world of NLP for avariety of tasks and have a high impact in industry.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Artificial Intelligence"],
      "source_ids": ["68feaa36b09198893aba708a"]
    },
    {
      "id": "COURSE_CSC3349",
      "labels": ["Course"],
      "course_code": "CSC3349",
      "course_title": "Data Warehousing",
      "description": "The course covers some advanced issues in database systems, including database storage, indexing and, ‘query processing, etc. Significant focus is placed on data warehouse design and architecture, including the fundamental concepts of dimensional modeling, covering star schemas and OLAP cubes. ETL and analytical querying and reporting for better decision-support are addressed, using case study analysis, and project design.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Big Data Analytics"],
      "source_ids": ["68feaa37b09198893aba708b"]
    },
    {
      "id": "COURSE_CSC3357",
      "labels": ["Course"],
      "course_code": "CSC3357",
      "course_title": "Object Oriented Design",
      "description": "The purpose of this course is to take students through the process of object-oriented analysis and design using the Unified Modeling Language (UML) and the Unified Process (UP). This course introduces the rational unified process, then the fundamental principles of object-oriented approaches to modeling software requirements and design. Topics include strategies for identifying objects and classes of objects, specification of software requirements and design, the design of class hierarchies, software reuse considerations, graphical notations, system implementation using object-oriented. Major models of the Unified Modeling Language (UML) will be covered such as use case model, class model, object ‘model, interaction model, etc. The student will be also introduced to design patterns. Design patterns are the reusable building blocks that object-oriented developers apply to create robust design models. This course will provide the student with the skills to understand and make use of UML and design patterns in various projects. Case studies are used to illustrate and reinforce the underlying concepts.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Software Engineering"],
      "source_ids": ["68feaa37b09198893aba708c"]
    },
    {
      "id": "COURSE_CSC3358",
      "labels": ["Course"],
      "course_code": "CSC3358",
      "course_title": "Blockchain Business Application",
      "description": "This course is intended to provide a theoretical background and hands-on knowledge of key elements for Blockchain for business applications developer. It introduces students to Blockchain concepts such as business networks, participants, assets, and trusted transactions, Hyperledger Fabric, Hyperledger ‘Composer, and other Blockchain platforms, smart contracts, consensus, and architecture of Blockchain solutions. The course will also review some scalability problems of Blockchain and how off-chain protocols can help resolve these problems.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Software Engineering"],
      "source_ids": ["68feaa37b09198893aba708d"]
    },
    {
      "id": "COURSE_CSC4199",
      "labels": ["Course"],
      "course_code": "CSC4199",
      "course_title": ", 4299, 4399, 4499, 4599 Special Topics in Computer Science (Title to be assigned",
      "description": "Special topics in computer science. Courses may be taught by visiting or AUI faculty. This course is intended primarily for juniors and seniors. Can be repeated (not to exceed 6 SCH).",
      "sch_credits": 1,
      "n_credits": 1,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Advanced Computer Science"],
      "source_ids": ["68feaa37b09198893aba7090", "68fec3aa49a8c5fdb99896e1"]
    },
    {
      "id": "COURSE_CSC4306",
      "labels": ["Course"],
      "course_code": "CSC4306",
      "course_title": "Software Project Management",
      "description": "This course requires students to encounter issues related to managing the successful development and realization of real, quality, software projects. A successful project is “one that delivers to the customer everything specified, to the quality agreed, on time and within cost.” Herein, quality may be defined as fitness for a purpose, or conformance to specifications. The course covers the principles, themes, processes and tools for project management, as well as their extension for agile project management.Students will work on a real-life project that they will manage through a specific project management framework or method.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Software Engineering"],
      "source_ids": ["68feaa37b09198893aba7091"]
    },
    {
      "id": "COURSE_CSC4309",
      "labels": ["Course"],
      "course_code": "CSC4309",
      "course_title": "Enterprise Cloud and Mobile Application Architecture, Design and Development",
      "description": "This course provides a solid background – both theoretical and practical – on the architecture, design and full stack development of enterprise-class, cloud-based, mobile-first progressive applications, based on well-defined security, performance, scalability, extensibility and integration requirements. Such an architecture, design and development are performed according to best practices and patterns and using state-of-the-art technology in order to promote developer productivity and reduce application lifecycle management costs and risks.\nTopics include MVC paradigm, SOA model, component-based development, as well as microservices architectural patterns, such as API gateway, circuit breaker, CQRS and asynchronous event-based architecture.\nOn server side, technologies include Spring Boot, Spring Cloud, Firebase and a variety of database management systems, such as Postgres, Redis, MongoDB, Ignite and Cassandra. On client side, technologies include modern JavaScript frameworks, such as Angular, React, Vue and Svelt, as well as Material Design. Focus will be put on progressive, mobile-first FIRE (fast, integrated, reliable, engaging) applications, with caching, offline access and real-time notifications capabilities.\nBoth sides will be integrated synchronously using REST architectural style, as well as asynchronously through message brokering and streaming technologies, such as Kafka and RabbitMQ. A project-based learning is adopted, and students will work on XCommerce, an enterprise-class e-commerce application for educational purposes.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Specialization"],
      "disciplines": ["Software Engineering"],
      "source_ids": ["68feaa37b09198893aba7094"]
    },
    {
      "id": "COURSE_CSC4352",
      "labels": ["Course"],
      "course_code": "CSC4352",
      "course_title": "Big Data Analytics",
      "description": "This course provides concepts and tools for building and adapting data-oriented analytical models based ‘on massive data of different formats, using the parallel and distributed programming paradigms and data structures.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Specialization"],
      "disciplines": ["Big Data Analytics"],
      "source_ids": ["68feaa37b09198893aba7096"]
    },
    {
      "id": "COURSE_CSC3359",
      "labels": ["Course"],
      "course_code": "CSC3359",
      "course_title": "Software Testing and Analysis",
      "description": "This course presents an overview of the principles and practices of software testing. It covers different concepts and techniques on how to test software. Topics include various testing methods such as structural and functional testing; various testing approaches such as unit, integration, regression and system testing. Students will also be introduced to manual and automatic techniques for generating test cases.\nThe objective of this course is to emphasize the importance of testing, and to prepare students to test software in an organized and systematic way. This course will provide theoretical and practical knowledge, as well as current research on software testing. Upon completion of the course, students will be capable of planning and applying various testing techniques and strategies for testing software.",
      "sch_credits": 3,
      "n_credits": 3,
      "isElective": true,
      "isMinorElective": false,
      "isSpecElective": true,
      "categories": ["Specialization"],
      "disciplines": ["Software Engineering"],
      "source_ids": ["68fecc7b900a1bff5afca2b6"]
    },
    {
      "id": "COURSE_MTH1311",
      "labels": ["Course"],
      "course_code": "MTH1311",
      "course_title": "Calculus 1",
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": [],
      "source_ids": [null]
    },
    {
      "id": "COURSE_MTH1312",
      "labels": ["Course"],
      "course_code": "MTH1312",
      "course_title": "Calculus 2",
      "n_credits": 3,
      "isElective": false,
      "isMinorElective": false,
      "isSpecElective": false,
      "categories": ["Math_Engineering_Science"],
      "disciplines": [],
      "source_ids": [null, null]
    },
    {
      "id": "CAT_Minor",
      "labels": ["Category"],
      "name": "Minor"
    },
    {
      "id": "CAT_Free_Electives",
      "labels": ["Category"],
      "name": "Free_Electives"
    },
    {
      "id": "CAT_GenEd",
      "labels": ["Category"],
      "name": "GenEd"
    },
    {
      "id": "CAT_Math_Engineering_Science",
      "labels": ["Category"],
      "name": "Math_Engineering_Science"
    },
    {
      "id": "CAT_Computer_Science",
      "labels": ["Category"],
      "name": "Computer_Science"
    },
    {
      "id": "CAT_Specialization",
      "labels": ["Category"],
      "name": "Specialization"
    },
    {
      "id": "SUB_Minor_Communication",
      "labels": ["Subcategory"],
      "category": "Minor",
      "discipline": "Communication"
    },
    {
      "id": "SUB_Minor_International_Studies",
      "labels": ["Subcategory"],
      "category": "Minor",
      "discipline": "International Studies"
    },
    {
      "id": "SUB_Minor_Business_Administration",
      "labels": ["Subcategory"],
      "category": "Minor",
      "discipline": "Business Administration"
    },
    {
      "id": "SUB_Minor_Free_Electives",
      "labels": ["Subcategory"],
      "category": "Minor",
      "discipline": "Free Electives"
    },
    {
      "id": "SUB_Free_Electives_Business_Administration",
      "labels": ["Subcategory"],
      "category": "Free_Electives",
      "discipline": "Business Administration"
    },
    {
      "id": "SUB_Free_Electives_Free_Electives",
      "labels": ["Subcategory"],
      "category": "Free_Electives",
      "discipline": "Free Electives"
    },
    {
      "id": "SUB_Minor_Social_Sciences",
      "labels": ["Subcategory"],
      "category": "Minor",
      "discipline": "Social Sciences"
    },
    {
      "id": "SUB_GenEd_International_Studies",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "International Studies"
    },
    {
      "id": "SUB_GenEd_Social_Sciences",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "Social Sciences"
    },
    {
      "id": "SUB_Minor_History_or_Political_Science",
      "labels": ["Subcategory"],
      "category": "Minor",
      "discipline": "History or Political Science"
    },
    {
      "id": "SUB_GenEd_History_or_Political_Science",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "History or Political Science"
    },
    {
      "id": "SUB_Minor_Psychology",
      "labels": ["Subcategory"],
      "category": "Minor",
      "discipline": "Psychology"
    },
    {
      "id": "SUB_Free_Electives_Communication",
      "labels": ["Subcategory"],
      "category": "Free_Electives",
      "discipline": "Communication"
    },
    {
      "id": "SUB_Free_Electives_History_or_Political_Science",
      "labels": ["Subcategory"],
      "category": "Free_Electives",
      "discipline": "History or Political Science"
    },
    {
      "id": "SUB_GenEd_Free_Electives",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "Free Electives"
    },
    {
      "id": "SUB_Free_Electives_Art_Appreciation_Creation",
      "labels": ["Subcategory"],
      "category": "Free_Electives",
      "discipline": "Art Appreciation & Creation"
    },
    {
      "id": "SUB_GenEd_Art_Appreciation_Creation",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "Art Appreciation & Creation"
    },
    {
      "id": "SUB_Free_Electives_Humanities",
      "labels": ["Subcategory"],
      "category": "Free_Electives",
      "discipline": "Humanities"
    },
    {
      "id": "SUB_GenEd_Humanities",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "Humanities"
    },
    {
      "id": "SUB_Minor_Art_Appreciation_Creation",
      "labels": ["Subcategory"],
      "category": "Minor",
      "discipline": "Art Appreciation & Creation"
    },
    {
      "id": "SUB_GenEd_Communication",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "Communication"
    },
    {
      "id": "SUB_GenEd_Arabic",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "Arabic"
    },
    {
      "id": "SUB_GenEd_Civic_Engagement",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "Civic Engagement"
    },
    {
      "id": "SUB_GenEd_English",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "English"
    },
    {
      "id": "SUB_GenEd_Foundations_for_Academic_Success",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "Foundations for Academic Success"
    },
    {
      "id": "SUB_GenEd_French",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "French"
    },
    {
      "id": "SUB_GenEd_First_Year_Experience",
      "labels": ["Subcategory"],
      "category": "GenEd",
      "discipline": "First Year Experience"
    },
    {
      "id": "SUB_Math_Engineering_Science_Sciences",
      "labels": ["Subcategory"],
      "category": "Math_Engineering_Science",
      "discipline": "Sciences"
    },
    {
      "id": "SUB_Math_Engineering_Science_Mathematics",
      "labels": ["Subcategory"],
      "category": "Math_Engineering_Science",
      "discipline": "Mathematics"
    },
    {
      "id": "SUB_Computer_Science_Computer_Science",
      "labels": ["Subcategory"],
      "category": "Computer_Science",
      "discipline": "Computer Science"
    },
    {
      "id": "SUB_Computer_Science_Artificial_Intelligence",
      "labels": ["Subcategory"],
      "category": "Computer_Science",
      "discipline": "Artificial Intelligence"
    },
    {
      "id": "SUB_Computer_Science_Advanced_Computer_Science",
      "labels": ["Subcategory"],
      "category": "Computer_Science",
      "discipline": "Advanced Computer Science"
    },
    {
      "id": "SUB_Specialization_Computer_Science",
      "labels": ["Subcategory"],
      "category": "Specialization",
      "discipline": "Computer Science"
    },
    {
      "id": "SUB_Specialization_Artificial_Intelligence",
      "labels": ["Subcategory"],
      "category": "Specialization",
      "discipline": "Artificial Intelligence"
    },
    {
      "id": "SUB_Specialization_Advanced_Computer_Science",
      "labels": ["Subcategory"],
      "category": "Specialization",
      "discipline": "Advanced Computer Science"
    },
    {
      "id": "SUB_Computer_Science_Computer_Systems",
      "labels": ["Subcategory"],
      "category": "Computer_Science",
      "discipline": "Computer Systems"
    },
    {
      "id": "SUB_Specialization_Computer_Systems",
      "labels": ["Subcategory"],
      "category": "Specialization",
      "discipline": "Computer Systems"
    },
    {
      "id": "SUB_Computer_Science_Big_Data_Analytics",
      "labels": ["Subcategory"],
      "category": "Computer_Science",
      "discipline": "Big Data Analytics"
    },
    {
      "id": "SUB_Specialization_Big_Data_Analytics",
      "labels": ["Subcategory"],
      "category": "Specialization",
      "discipline": "Big Data Analytics"
    },
    {
      "id": "SUB_Computer_Science_Software_Engineering",
      "labels": ["Subcategory"],
      "category": "Computer_Science",
      "discipline": "Software Engineering"
    },
    {
      "id": "SUB_Specialization_Software_Engineering",
      "labels": ["Subcategory"],
      "category": "Specialization",
      "discipline": "Software Engineering"
    }
  ],
  "relationships": [
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Minor",
      "endNode": "SUB_Minor_Communication"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Minor",
      "endNode": "SUB_Minor_International_Studies"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Minor",
      "endNode": "SUB_Minor_Business_Administration"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Minor",
      "endNode": "SUB_Minor_Free_Electives"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Free_Electives",
      "endNode": "SUB_Free_Electives_Business_Administration"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Free_Electives",
      "endNode": "SUB_Free_Electives_Free_Electives"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Minor",
      "endNode": "SUB_Minor_Social_Sciences"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_International_Studies"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_Social_Sciences"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Minor",
      "endNode": "SUB_Minor_History_or_Political_Science"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_History_or_Political_Science"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Minor",
      "endNode": "SUB_Minor_Psychology"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Free_Electives",
      "endNode": "SUB_Free_Electives_Communication"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Free_Electives",
      "endNode": "SUB_Free_Electives_History_or_Political_Science"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_Free_Electives"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Free_Electives",
      "endNode": "SUB_Free_Electives_Art_Appreciation_Creation"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_Art_Appreciation_Creation"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Free_Electives",
      "endNode": "SUB_Free_Electives_Humanities"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_Humanities"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Minor",
      "endNode": "SUB_Minor_Art_Appreciation_Creation"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_Communication"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_Arabic"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_Civic_Engagement"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_English"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_Foundations_for_Academic_Success"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_French"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_GenEd",
      "endNode": "SUB_GenEd_First_Year_Experience"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Math_Engineering_Science",
      "endNode": "SUB_Math_Engineering_Science_Sciences"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Math_Engineering_Science",
      "endNode": "SUB_Math_Engineering_Science_Mathematics"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Computer_Science",
      "endNode": "SUB_Computer_Science_Computer_Science"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Computer_Science",
      "endNode": "SUB_Computer_Science_Artificial_Intelligence"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Computer_Science",
      "endNode": "SUB_Computer_Science_Advanced_Computer_Science"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Specialization",
      "endNode": "SUB_Specialization_Computer_Science"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Specialization",
      "endNode": "SUB_Specialization_Artificial_Intelligence"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Specialization",
      "endNode": "SUB_Specialization_Advanced_Computer_Science"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Computer_Science",
      "endNode": "SUB_Computer_Science_Computer_Systems"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Specialization",
      "endNode": "SUB_Specialization_Computer_Systems"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Computer_Science",
      "endNode": "SUB_Computer_Science_Big_Data_Analytics"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Specialization",
      "endNode": "SUB_Specialization_Big_Data_Analytics"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Computer_Science",
      "endNode": "SUB_Computer_Science_Software_Engineering"
    },
    {
      "type": "HAS_SUBCATEGORY",
      "startNode": "CAT_Specialization",
      "endNode": "SUB_Specialization_Software_Engineering"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM4304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM4401"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM4405"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_International_Studies",
      "endNode": "COURSE_ECO2310"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_FIN3301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_GBU3311"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Free_Electives",
      "endNode": "COURSE_GBU3311"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Business_Administration",
      "endNode": "COURSE_GBU3311"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_GBU3311"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_GBU4308"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_International_Studies",
      "endNode": "COURSE_GEO1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Social_Sciences",
      "endNode": "COURSE_GEO1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_International_Studies",
      "endNode": "COURSE_GEO1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Social_Sciences",
      "endNode": "COURSE_GEO1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_International_Studies",
      "endNode": "COURSE_HIS3301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_International_Studies",
      "endNode": "COURSE_INS2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_International_Studies",
      "endNode": "COURSE_INS3303"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_MGT3301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_MGT3302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_MGT4303"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_MIS3302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_MKT3301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_MKT4304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_MKT4305"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_International_Studies",
      "endNode": "COURSE_PSC2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_History_or_Political_Science",
      "endNode": "COURSE_PSC2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_International_Studies",
      "endNode": "COURSE_PSC2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_History_or_Political_Science",
      "endNode": "COURSE_PSC2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY1303"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY2302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY2303"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY2304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY3302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY3304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY3305"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY3306"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY3391"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY3392"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY3393"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Psychology",
      "endNode": "COURSE_PSY3395"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_SCM4301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_CHE1400"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Communication",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Free_Electives",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_CSC1300"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_ENG2304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_ENG2311"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_HIS2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_History_or_Political_Science",
      "endNode": "COURSE_HIS2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Free_Electives",
      "endNode": "COURSE_HIS2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_History_or_Political_Science",
      "endNode": "COURSE_HIS2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_HRD2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_HRD3302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_HUM2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Art_Appreciation_Creation",
      "endNode": "COURSE_HUM2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Free_Electives",
      "endNode": "COURSE_HUM2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_HUM2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_LIT2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Humanities",
      "endNode": "COURSE_LIT2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Free_Electives",
      "endNode": "COURSE_LIT2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Humanities",
      "endNode": "COURSE_LIT2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_LIT2304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_MTH1305"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_MTH1388"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_PHY1400"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Free_Electives_Free_Electives",
      "endNode": "COURSE_SPN1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_ACC2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Business_Administration",
      "endNode": "COURSE_ACC2302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM2327"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Art_Appreciation_Creation",
      "endNode": "COURSE_COM2327"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Communication",
      "endNode": "COURSE_COM2327"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_COM2327"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM2403"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM2404"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3311"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3315"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3321"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3328"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3330"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3398"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3399"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Minor_Communication",
      "endNode": "COURSE_COM3402"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Arabic",
      "endNode": "COURSE_ARA1201"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Arabic",
      "endNode": "COURSE_ARA1202"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Arabic",
      "endNode": "COURSE_ARA1203"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Arabic",
      "endNode": "COURSE_ARA3299"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Arabic",
      "endNode": "COURSE_ARB1201"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Arabic",
      "endNode": "COURSE_ARB1202"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Arabic",
      "endNode": "COURSE_ARB1203"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Arabic",
      "endNode": "COURSE_ARB1241"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_ART1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_ART1302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_ART1303"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_ART1304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_ART1305"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Civic_Engagement",
      "endNode": "COURSE_CIP2000"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Communication",
      "endNode": "COURSE_COM1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Social_Sciences",
      "endNode": "COURSE_ECO1300"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_English",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_English",
      "endNode": "COURSE_ENG2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_English",
      "endNode": "COURSE_ENG2302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_English",
      "endNode": "COURSE_ENG2303"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_ENG2320"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Foundations_for_Academic_Success",
      "endNode": "COURSE_FAS0210"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Foundations_for_Academic_Success",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_French",
      "endNode": "COURSE_FRN3310"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_First_Year_Experience",
      "endNode": "COURSE_FYE1101"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_First_Year_Experience",
      "endNode": "COURSE_FYE1102"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_History_or_Political_Science",
      "endNode": "COURSE_HIS1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_History_or_Political_Science",
      "endNode": "COURSE_HUM1310"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_History_or_Political_Science",
      "endNode": "COURSE_HUM2302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Humanities",
      "endNode": "COURSE_HUM2305"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Humanities",
      "endNode": "COURSE_HUM2306"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Humanities",
      "endNode": "COURSE_HUM2307"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Art_Appreciation_Creation",
      "endNode": "COURSE_LIT3370"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Humanities",
      "endNode": "COURSE_PHI2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Humanities",
      "endNode": "COURSE_PHI2302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Social_Sciences",
      "endNode": "COURSE_PSY1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Civic_Engagement",
      "endNode": "COURSE_SLP1101"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Social_Sciences",
      "endNode": "COURSE_SOC1301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Social_Sciences",
      "endNode": "COURSE_SSC1310"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Sciences",
      "endNode": "COURSE_BIO1401"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Sciences",
      "endNode": "COURSE_BIO1402"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Sciences",
      "endNode": "COURSE_CHE1401"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_GenEd_Social_Sciences",
      "endNode": "COURSE_EGR2302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Mathematics",
      "endNode": "COURSE_MTH1303"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Mathematics",
      "endNode": "COURSE_MTH1304"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Mathematics",
      "endNode": "COURSE_MTH2301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Mathematics",
      "endNode": "COURSE_MTH2320"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Mathematics",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Sciences",
      "endNode": "COURSE_PHY1401"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Math_Engineering_Science_Sciences",
      "endNode": "COURSE_PHY1402"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC1401"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC2302"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC2305"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Artificial_Intelligence",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Advanced_Computer_Science",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Artificial_Intelligence",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Advanced_Computer_Science",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3315"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3323"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3324"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3328"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Systems",
      "endNode": "COURSE_CSC3328"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC3328"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Systems",
      "endNode": "COURSE_CSC3328"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3329"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Systems",
      "endNode": "COURSE_CSC3329"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Big_Data_Analytics",
      "endNode": "COURSE_CSC3329"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC3329"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Systems",
      "endNode": "COURSE_CSC3329"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Big_Data_Analytics",
      "endNode": "COURSE_CSC3329"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Systems",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Big_Data_Analytics",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Systems",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Big_Data_Analytics",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3346"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Big_Data_Analytics",
      "endNode": "COURSE_CSC3346"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC3346"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Big_Data_Analytics",
      "endNode": "COURSE_CSC3346"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3371"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3373"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Systems",
      "endNode": "COURSE_CSC3373"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC3373"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Systems",
      "endNode": "COURSE_CSC3373"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3374"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC3376"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Systems",
      "endNode": "COURSE_CSC3376"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC3376"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Systems",
      "endNode": "COURSE_CSC3376"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC4307"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Software_Engineering",
      "endNode": "COURSE_CSC4307"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC4307"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Software_Engineering",
      "endNode": "COURSE_CSC4307"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC4308"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Advanced_Computer_Science",
      "endNode": "COURSE_CSC4308"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC4308"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Advanced_Computer_Science",
      "endNode": "COURSE_CSC4308"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSC4351"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Big_Data_Analytics",
      "endNode": "COURSE_CSC4351"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSC4351"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Big_Data_Analytics",
      "endNode": "COURSE_CSC4351"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_CSCS3359"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Software_Engineering",
      "endNode": "COURSE_CSCS3359"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Computer_Science",
      "endNode": "COURSE_CSCS3359"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Software_Engineering",
      "endNode": "COURSE_CSCS3359"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_EGR4300"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Computer_Science_Computer_Science",
      "endNode": "COURSE_EGR4402"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Artificial_Intelligence",
      "endNode": "COURSE_CSC3310"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Artificial_Intelligence",
      "endNode": "COURSE_CSC3311"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Artificial_Intelligence",
      "endNode": "COURSE_CSC3347"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Artificial_Intelligence",
      "endNode": "COURSE_CSC3348"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Big_Data_Analytics",
      "endNode": "COURSE_CSC3349"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Software_Engineering",
      "endNode": "COURSE_CSC3357"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Software_Engineering",
      "endNode": "COURSE_CSC3358"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Advanced_Computer_Science",
      "endNode": "COURSE_CSC4199"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Software_Engineering",
      "endNode": "COURSE_CSC4306"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Software_Engineering",
      "endNode": "COURSE_CSC4309"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Big_Data_Analytics",
      "endNode": "COURSE_CSC4352"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "SUB_Specialization_Software_Engineering",
      "endNode": "COURSE_CSC3359"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "CAT_Math_Engineering_Science",
      "endNode": "COURSE_MTH1311"
    },
    {
      "type": "HAS_COURSE",
      "startNode": "CAT_Math_Engineering_Science",
      "endNode": "COURSE_MTH1312"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM4405",
      "endNode": "COURSE_COM3402"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_FIN3301",
      "endNode": "COURSE_ACC2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_FIN3301",
      "endNode": "COURSE_ACC2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_FIN3301",
      "endNode": "COURSE_EGR2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_GBU3311",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_GBU4308",
      "endNode": "COURSE_MGT3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_GEO1301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_GEO1301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS3301",
      "endNode": "COURSE_HIS2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS3301",
      "endNode": "COURSE_HIS1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS3301",
      "endNode": "COURSE_HIS2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_INS2301",
      "endNode": "COURSE_PSC2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_INS2301",
      "endNode": "COURSE_PSC2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_INS3303",
      "endNode": "COURSE_INS2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT3301",
      "endNode": "COURSE_ACC2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT3301",
      "endNode": "COURSE_ACC2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT3301",
      "endNode": "COURSE_EGR2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT3302",
      "endNode": "COURSE_FIN3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT3302",
      "endNode": "COURSE_MGT3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT3302",
      "endNode": "COURSE_MKT3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT4303",
      "endNode": "COURSE_GBU3311"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT4303",
      "endNode": "COURSE_MGT3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT4303",
      "endNode": "COURSE_GBU3311"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MGT4303",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MKT3301",
      "endNode": "COURSE_ACC2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MKT3301",
      "endNode": "COURSE_ACC2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MKT3301",
      "endNode": "COURSE_EGR2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MKT4304",
      "endNode": "COURSE_GBU3311"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MKT4304",
      "endNode": "COURSE_MKT3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MKT4304",
      "endNode": "COURSE_GBU3311"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MKT4304",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MKT4305",
      "endNode": "COURSE_MGT3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSC2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSC2301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSC2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSY1303",
      "endNode": "COURSE_PSY1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSY2302",
      "endNode": "COURSE_PSY1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSY2303",
      "endNode": "COURSE_PSY1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSY2304",
      "endNode": "COURSE_PSY1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSY3302",
      "endNode": "COURSE_PSY1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSY3305",
      "endNode": "COURSE_PSY1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSY3306",
      "endNode": "COURSE_PSY1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM1304",
      "endNode": "COURSE_COM1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_GBU3311",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS2301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HRD2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HRD2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_LIT2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_LIT2301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_LIT2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ACC2301",
      "endNode": "COURSE_MTH1305"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ACC2301",
      "endNode": "COURSE_MTH1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ACC2302",
      "endNode": "COURSE_ACC2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM1304",
      "endNode": "COURSE_COM1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM2301",
      "endNode": "COURSE_COM1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM2327",
      "endNode": "COURSE_COM2403"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM2403",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM2403",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM2404",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM2404",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM3301",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM3301",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM3304",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM3304",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM3321",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM3321",
      "endNode": "COURSE_COM1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM3330",
      "endNode": "COURSE_COM2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ART3399",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ART3399",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM1301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_COM2327",
      "endNode": "COURSE_COM2403"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ENG2301",
      "endNode": "COURSE_COM1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ENG2301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ENG2302",
      "endNode": "COURSE_COM1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ENG2302",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ENG2303",
      "endNode": "COURSE_COM1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ENG2303",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_ENG2320",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_FAS1220",
      "endNode": "COURSE_FAS0210"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_GEO1301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_GEO1301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS1301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS1301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS2301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HIS2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM1310",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM1310",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2302",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2302",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2305",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2305",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2306",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2306",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2307",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_HUM2307",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_LIT2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_LIT2301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_LIT2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PHI2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PHI2301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PHI2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PHI2302",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PHI2302",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PHI2302",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSC2301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSC2301",
      "endNode": "COURSE_ENG1301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSC2301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PSY1301",
      "endNode": "COURSE_FAS0210"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_SOC1301",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_SOC1301",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_SSC1310",
      "endNode": "COURSE_ART3399"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_SSC1310",
      "endNode": "COURSE_FAS1220"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MTH2301",
      "endNode": "COURSE_MTH1303"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MTH2320",
      "endNode": "COURSE_MTH2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_MTH3301",
      "endNode": "COURSE_MTH2301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_PHY1402",
      "endNode": "COURSE_PHY1401"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC2302",
      "endNode": "COURSE_CSC1401"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC2305",
      "endNode": "COURSE_PHY1402"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC2305",
      "endNode": "COURSE_CSC2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC2306",
      "endNode": "COURSE_MTH1304"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC2306",
      "endNode": "COURSE_CSC2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_CSC3323"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3315",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3323",
      "endNode": "COURSE_CSC2302"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3324",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3326",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3328",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3329",
      "endNode": "COURSE_CSC3371"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3331",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3346",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3351",
      "endNode": "COURSE_CSC2305"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3371",
      "endNode": "COURSE_CSC2305"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3373",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3373",
      "endNode": "COURSE_CSC3371"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3374",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3374",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3376",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4307",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4307",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4308",
      "endNode": "COURSE_CSC3371"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4351",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSCS3359",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_EGR4300",
      "endNode": "COURSE_ENG2303"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_EGR4300",
      "endNode": "COURSE_FRN3310"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_EGR4402",
      "endNode": "COURSE_ENG2303"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_CSC3323"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3310",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3310",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3310",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3311",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3311",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3311",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3328",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3329",
      "endNode": "COURSE_CSC3371"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3331",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3346",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3347",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3347",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3347",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3348",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3348",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3348",
      "endNode": "COURSE_CSC3309"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3349",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3357",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3358",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3373",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3373",
      "endNode": "COURSE_CSC3371"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3376",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4306",
      "endNode": "COURSE_CSC3324"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4307",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4307",
      "endNode": "COURSE_CSC3351"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4308",
      "endNode": "COURSE_CSC3371"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4309",
      "endNode": "COURSE_CSC3374"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4351",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4352",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4352",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC4352",
      "endNode": "COURSE_CSC3331"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSCS3359",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3331",
      "endNode": "COURSE_CSC3326"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_MTH3301"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_CSC2306"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3309",
      "endNode": "COURSE_CSC3323"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3329",
      "endNode": "COURSE_CSC3371"
    },
    {
      "type": "REQUIRES",
      "startNode": "COURSE_CSC3359",
      "endNode": "COURSE_CSC2306"
    }
  ]
}
